Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/rvcsr.h
// THIS HEADER FILE IS AUTOMATICALLY GENERATED -- DO NOT EDIT

/**
 * Copyright (c) 2024 Raspberry Pi Ltd.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
// =============================================================================
// Register block : RVCSR
// Version        : 1
// Bus type       : apb
// Description    : CSR listing for Hazard3
// =============================================================================
#ifndef _HARDWARE_REGS_RVCSR_H
#define _HARDWARE_REGS_RVCSR_H
// =============================================================================
// Register    : RVCSR_MSTATUS
// Description : Machine status register
#define RVCSR_MSTATUS_OFFSET _u(0x00000300)
#define RVCSR_MSTATUS_BITS   _u(0x00221888)
#define RVCSR_MSTATUS_RESET  _u(0x00001800)
// -----------------------------------------------------------------------------
// Field       : RVCSR_MSTATUS_TW
// Description : Timeout wait. When 1, attempting to execute a WFI instruction
//               in U-mode will instantly cause an illegal instruction
//               exception.
#define RVCSR_MSTATUS_TW_RESET  _u(0x0)
#define RVCSR_MSTATUS_TW_BITS   _u(0x00200000)
#define RVCSR_MSTATUS_TW_MSB    _u(21)
#define RVCSR_MSTATUS_TW_LSB    _u(21)
#define RVCSR_MSTATUS_TW_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RVCSR_MSTATUS_MPRV
// Description : Modify privilege. If 1, loads and stores behave as though the
//               current privilege level were `mpp`. This includes physical
//               memory protection checks, and the privilege level asserted on
//               the system bus alongside the load/store address.
#define RVCSR_MSTATUS_MPRV_RESET  _u(0x0)
#define RVCSR_MSTATUS_MPRV_BITS   _u(0x00020000)
#define RVCSR_MSTATUS_MPRV_MSB    _u(17)
#define RVCSR_MSTATUS_MPRV_LSB    _u(17)
#define RVCSR_MSTATUS_MPRV_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RVCSR_MSTATUS_MPP
// Description : Previous privilege level. Can store the values 3 (M-mode) or 0
//               (U-mode). If another value is written, hardware rounds to the
//               nearest supported mode.
#define RVCSR_MSTATUS_MPP_RESET  _u(0x3)
#define RVCSR_MSTATUS_MPP_BITS   _u(0x00001800)
#define RVCSR_MSTATUS_MPP_MSB    _u(12)
#define RVCSR_MSTATUS_MPP_LSB    _u(11)
#define RVCSR_MSTATUS_MPP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RVCSR_MSTATUS_MPIE
// Description : Previous interrupt enable. Readable and writable. Is set to the
//               current value of `mstatus.mie` on trap entry. Is set to 1 on
//               trap return.
#define RVCSR_MSTATUS_MPIE_RESET  _u(0x0)
#define RVCSR_MSTATUS_MPIE_BITS   _u(0x00000080)
#define RVCSR_MSTATUS_MPIE_MSB    _u(7)
#define RVCSR_MSTATUS_MPIE_LSB    _u(7)
#define RVCSR_MSTATUS_MPIE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RVCSR_MSTATUS_MIE
// Description : Interrupt enable. Readable and writable. Is set to 0 on trap
//               entry. Is set to the current value of `mstatus.mpie` on trap
//               return.
#define RVCSR_MSTATUS_MIE_RESET  _u(0x0)
#define RVCSR_MSTATUS_MIE_BITS   _u(0x00000008)
#define RVCSR_MSTATUS_MIE_MSB    _u(3)
#define RVCSR_MSTATUS_MIE_LSB    _u(3)
#define RVCSR_MSTATUS_MIE_ACCESS "RW"
// =============================================================================
// Register    : RVCSR_MISA
// Description : Summary of ISA extension support
//
//               On RP2350, Hazard3's full `-march` string is:
//               `rv32ima_zicsr_zifencei_zba_zbb_zbs_zbkb_zca_zcb_zcmp`
//
//               Note Zca is equivalent to the C extension in this case; all
//               instructions from the RISC-V C extension relevant to a 32-bit
//               non-floating-point processor are supported. On older toolchains
//               which do not support the Zc extensions, the appropriate
//               `-march` string is: `rv32imac_zicsr_zifencei_zba_zbb_zbs_zbkb`
//
//               In addition the following custom extensions are configured:
//               Xh3bm, Xh3power, Xh3irq, Xh3pmpm
#define RVCSR_MISA_OFFSET _u(0x00000301)
#define RVCSR_MISA_BITS   _u(0xc0b511bf)
#define RVCSR_MISA_RESET  _u(0x40901105)
// -----------------------------------------------------------------------------
// Field       : RVCSR_MISA_MXL
// Description : Value of 0x1 indicates this is a 32-bit processor.
#define RVCSR_MISA_MXL_RESET  _u(0x1)
#define RVCSR_MISA_MXL_BITS   _u(0xc0000000)
#define RVCSR_MISA_MXL_MSB    _u(31)
#define RVCSR_MISA_MXL_LSB    _u(30)
#define RVCSR_MISA_MXL_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RVCSR_MISA_X
// Description : Value of 1 indicates nonstandard extensions are present. (Xh3b
//               bit manipulation, and custom sleep and interrupt control CSRs)
#define RVCSR_MISA_X_RESET  _u(0x1)
#define RVCSR_MISA_X_BITS   _u(0x00800000)
#define RVCSR_MISA_X_MSB    _u(23)
#define RVCSR_MISA_X_LSB    _u(23)
#define RVCSR_MISA_X_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RVCSR_MISA_V
// Description : Vector extension (not implemented).
#define RVCSR_MISA_V_RESET  _u(0x0)
#define RVCSR_MISA_V_BITS   _u(0x00200000)
#define RVCSR_MISA_V_MSB    _u(21)
#define RVCSR_MISA_V_LSB    _u(21)
#define RVCSR_MISA_V_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RVCSR_MISA_U
// Description : Value of 1 indicates U-mode is implemented.
#define RVCSR_MISA_U_RESET  _u(0x1)
#define RVCSR_MISA_U_BITS   _u(0x00100000)
#define RVCSR_MISA_U_MSB    _u(20)
#define RVCSR_MISA_U_LSB    _u(20)
#define RVCSR_MISA_U_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RVCSR_MISA_S
// Description : Supervisor extension (not implemented).
#define RVCSR_MISA_S_RESET  _u(0x0)
#define RVCSR_MISA_S_BITS   _u(0x00040000)
#define RVCSR_MISA_S_MSB    _u(18)
#define RVCSR_MISA_S_LSB    _u(18)
#define RVCSR_MISA_S_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RVCSR_MISA_Q
// Description : Quad-precision floating point extension (not implemented).
#define RVCSR_MISA_Q_RESET  _u(0x0)
#define RVCSR_MISA_Q_BITS   _u(0x00010000)
#define RVCSR_MISA_Q_MSB    _u(16)
#define RVCSR_MISA_Q_LSB    _u(16)
#define RVCSR_MISA_Q_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RVCSR_MISA_M
// Description : Value of 1 indicates the M extension (integer multiply/divide)
//               is implemented.
#define RVCSR_MISA_M_RESET  _u(0x1)
#define RVCSR_MISA_M_BITS   _u(0x00001000)
#define RVCSR_MISA_M_MSB    _u(12)
#define RVCSR_MISA_M_LSB    _u(12)
#define RVCSR_MISA_M_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RVCSR_MISA_I
// Description : Value of 1 indicates the RVI base ISA is implemented (as
//               opposed to RVE)
#define RVCSR_MISA_I_RESET  _u(0x1)
#define RVCSR_MISA_I_BITS   _u(0x00000100)
#define RVCSR_MISA_I_MSB    _u(8)
#define RVCSR_MISA_I_LSB    _u(8)
#define RVCSR_MISA_I_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RVCSR_MISA_H
// Description : Hypervisor extension (not implemented, I agree it would be
//               pretty cool on a microcontroller through).
#define RVCSR_MISA_H_RESET  _u(0x0)
#define RVCSR_MISA_H_BITS   _u(0x00000080)
#define RVCSR_MISA_H_MSB    _u(7)
#define RVCSR_MISA_H_LSB    _u(7)
#define RVCSR_MISA_H_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RVCSR_MISA_F
// Description : Single-precision floating point extension (not implemented).
#define RVCSR_MISA_F_RESET  _u(0x0)
#define RVCSR_MISA_F_BITS   _u(0x00000020)
#define RVCSR_MISA_F_MSB    _u(5)
#define RVCSR_MISA_F_LSB    _u(5)
#define RVCSR_MISA_F_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RVCSR_MISA_E
// Description : RV32E/64E base ISA (not implemented).
#define RVCSR_MISA_E_RESET  _u(0x0)
#define RVCSR_MISA_E_BITS   _u(0x00000010)
#define RVCSR_MISA_E_MSB    _u(4)
#define RVCSR_MISA_E_LSB    _u(4)
#define RVCSR_MISA_E_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RVCSR_MISA_D
// Description : Double-precision floating point extension (not implemented).
#define RVCSR_MISA_D_RESET  _u(0x0)
#define RVCSR_MISA_D_BITS   _u(0x00000008)
#define RVCSR_MISA_D_MSB    _u(3)
#define RVCSR_MISA_D_LSB    _u(3)
#define RVCSR_MISA_D_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RVCSR_MISA_C
// Description : Value of 1 indicates the C extension (compressed instructions)
//               is implemented.
#define RVCSR_MISA_C_RESET  _u(0x1)
#define RVCSR_MISA_C_BITS   _u(0x00000004)
#define RVCSR_MISA_C_MSB    _u(2)
#define RVCSR_MISA_C_LSB    _u(2)
#define RVCSR_MISA_C_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RVCSR_MISA_B
// Description : Value of 1 indicates the B extension (bit manipulation) is
//               implemented. B is the combination of Zba, Zbb and Zbs.
//
//               Hazard3 implements all of these extensions, but the definition
//               of B as ZbaZbbZbs did not exist at the point this version of
//               Hazard3 was taped out. This bit was reserved-0 at that point.
//               Therefore this bit reads as 0.
#define RVCSR_MISA_B_RESET  _u(0x0)
#define RVCSR_MISA_B_BITS   _u(0x00000002)
#define RVCSR_MISA_B_MSB    _u(1)
#define RVCSR_MISA_B_LSB    _u(1)
#define RVCSR_MISA_B_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RVCSR_MISA_A
// Description : Value of 1 indicates the A extension (atomics) is implemented.
#define RVCSR_MISA_A_RESET  _u(0x1)
#define RVCSR_MISA_A_BITS   _u(0x00000001)
#define RVCSR_MISA_A_MSB    _u(0)
#define RVCSR_MISA_A_LSB    _u(0)
#define RVCSR_MISA_A_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MEDELEG
// Description : Machine exception delegation register. Not implemented, as no
//               S-mode support.
#define RVCSR_MEDELEG_OFFSET _u(0x00000302)
#define RVCSR_MEDELEG_BITS   _u(0xffffffff)
#define RVCSR_MEDELEG_RESET  "-"
#define RVCSR_MEDELEG_MSB    _u(31)
#define RVCSR_MEDELEG_LSB    _u(0)
#define RVCSR_MEDELEG_ACCESS "RW"
// =============================================================================
// Register    : RVCSR_MIDELEG
// Description : Machine interrupt delegation register. Not implemented, as no
//               S-mode support.
#define RVCSR_MIDELEG_OFFSET _u(0x00000303)
#define RVCSR_MIDELEG_BITS   _u(0xffffffff)
#define RVCSR_MIDELEG_RESET  "-"
#define RVCSR_MIDELEG_MSB    _u(31)
#define RVCSR_MIDELEG_LSB    _u(0)
#define RVCSR_MIDELEG_ACCESS "RW"
// =============================================================================
// Register    : RVCSR_MIE
// Description : Machine interrupt enable register
#define RVCSR_MIE_OFFSET _u(0x00000304)
#define RVCSR_MIE_BITS   _u(0x00000888)
#define RVCSR_MIE_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : RVCSR_MIE_MEIE
// Description : External interrupt enable. The processor transfers to the
//               external interrupt vector when `mie.meie`, `mip.meip` and
//               `mstatus.mie` are all 1.
//
//               Hazard3 has internal registers to individually filter external
//               interrupts (see `meiea`), but this standard control can be used
//               to mask all external interrupts at once.
#define RVCSR_MIE_MEIE_RESET  _u(0x0)
#define RVCSR_MIE_MEIE_BITS   _u(0x00000800)
#define RVCSR_MIE_MEIE_MSB    _u(11)
#define RVCSR_MIE_MEIE_LSB    _u(11)
#define RVCSR_MIE_MEIE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RVCSR_MIE_MTIE
// Description : Timer interrupt enable. The processor transfers to the timer
//               interrupt vector when `mie.mtie`, `mip.mtip` and `mstatus.mie`
//               are all 1, unless a software or external interrupt request is
//               also both pending and enabled at this time.
#define RVCSR_MIE_MTIE_RESET  _u(0x0)
#define RVCSR_MIE_MTIE_BITS   _u(0x00000080)
#define RVCSR_MIE_MTIE_MSB    _u(7)
#define RVCSR_MIE_MTIE_LSB    _u(7)
#define RVCSR_MIE_MTIE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RVCSR_MIE_MSIE
// Description : Software interrupt enable. The processor transfers to the
//               software interrupt vector when `mie.msie`, `mip.msip` and
//               `mstatus.mie` are all 1, unless an external interrupt request
//               is also both pending and enabled at this time.
#define RVCSR_MIE_MSIE_RESET  _u(0x0)
#define RVCSR_MIE_MSIE_BITS   _u(0x00000008)
#define RVCSR_MIE_MSIE_MSB    _u(3)
#define RVCSR_MIE_MSIE_LSB    _u(3)
#define RVCSR_MIE_MSIE_ACCESS "RW"
// =============================================================================
// Register    : RVCSR_MTVEC
// Description : Machine trap handler base address.
#define RVCSR_MTVEC_OFFSET _u(0x00000305)
#define RVCSR_MTVEC_BITS   _u(0xffffffff)
#define RVCSR_MTVEC_RESET  _u(0x00007ffc)
// -----------------------------------------------------------------------------
// Field       : RVCSR_MTVEC_BASE
// Description : The upper 30 bits of the trap vector address (2 LSBs are
//               implicitly 0). Must be 64-byte-aligned if vectoring is enabled.
//               Otherwise, must be 4-byte-aligned.
#define RVCSR_MTVEC_BASE_RESET  _u(0x00001fff)
#define RVCSR_MTVEC_BASE_BITS   _u(0xfffffffc)
#define RVCSR_MTVEC_BASE_MSB    _u(31)
#define RVCSR_MTVEC_BASE_LSB    _u(2)
#define RVCSR_MTVEC_BASE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RVCSR_MTVEC_MODE
// Description : If 0 (direct mode), all traps set pc to the trap vector base.
//               If 1 (vectored), exceptions set pc to the trap vector base, and
//               interrupts set pc to 4 times the interrupt cause (3=soft IRQ,
//               7=timer IRQ, 11=external IRQ).
//
//               The upper bit is hardwired to zero, so attempting to set mode
//               to 2 or 3 will result in a value of 0 or 1 respectively.
//               0x0 -> Direct entry to mtvec
//               0x1 -> Vectored entry to a 16-entry jump table starting at mtvec
#define RVCSR_MTVEC_MODE_RESET  _u(0x0)
#define RVCSR_MTVEC_MODE_BITS   _u(0x00000003)
#define RVCSR_MTVEC_MODE_MSB    _u(1)
#define RVCSR_MTVEC_MODE_LSB    _u(0)
#define RVCSR_MTVEC_MODE_ACCESS "RW"
#define RVCSR_MTVEC_MODE_VALUE_DIRECT _u(0x0)
#define RVCSR_MTVEC_MODE_VALUE_VECTORED _u(0x1)
// =============================================================================
// Register    : RVCSR_MCOUNTEREN
// Description : Counter enable. Control access to counters from U-mode. Not to
//               be confused with mcountinhibit.
#define RVCSR_MCOUNTEREN_OFFSET _u(0x00000306)
#define RVCSR_MCOUNTEREN_BITS   _u(0x00000007)
#define RVCSR_MCOUNTEREN_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : RVCSR_MCOUNTEREN_IR
// Description : If 1, U-mode is permitted to access the `instret`/`instreth`
//               instruction retire counter CSRs. Otherwise, U-mode accesses to
//               these CSRs will trap.
#define RVCSR_MCOUNTEREN_IR_RESET  _u(0x0)
#define RVCSR_MCOUNTEREN_IR_BITS   _u(0x00000004)
#define RVCSR_MCOUNTEREN_IR_MSB    _u(2)
#define RVCSR_MCOUNTEREN_IR_LSB    _u(2)
#define RVCSR_MCOUNTEREN_IR_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RVCSR_MCOUNTEREN_TM
// Description : No hardware effect, as the `time`/`timeh` CSRs are not
//               implemented. However, this field still exists, as M-mode
//               software can use it to track whether it should emulate U-mode
//               attempts to access those CSRs.
#define RVCSR_MCOUNTEREN_TM_RESET  _u(0x0)
#define RVCSR_MCOUNTEREN_TM_BITS   _u(0x00000002)
#define RVCSR_MCOUNTEREN_TM_MSB    _u(1)
#define RVCSR_MCOUNTEREN_TM_LSB    _u(1)
#define RVCSR_MCOUNTEREN_TM_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RVCSR_MCOUNTEREN_CY
// Description : If 1, U-mode is permitted to access the `cycle`/`cycleh` cycle
//               counter CSRs. Otherwise, U-mode accesses to these CSRs will
//               trap.
#define RVCSR_MCOUNTEREN_CY_RESET  _u(0x0)
#define RVCSR_MCOUNTEREN_CY_BITS   _u(0x00000001)
#define RVCSR_MCOUNTEREN_CY_MSB    _u(0)
#define RVCSR_MCOUNTEREN_CY_LSB    _u(0)
#define RVCSR_MCOUNTEREN_CY_ACCESS "RW"
// =============================================================================
// Register    : RVCSR_MENVCFG
// Description : Machine environment configuration register, low half
#define RVCSR_MENVCFG_OFFSET _u(0x0000030a)
#define RVCSR_MENVCFG_BITS   _u(0x00000001)
#define RVCSR_MENVCFG_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : RVCSR_MENVCFG_FIOM
// Description : When set, fence instructions in modes less privileged than
//               M-mode which specify that IO memory accesses are ordered will
//               also cause ordering of main memory accesses.
//
//               FIOM is hardwired to zero on Hazard3, because S-mode is not
//               supported, and because fence instructions execute as NOPs (with
//               the exception of `fence.i`)
#define RVCSR_MENVCFG_FIOM_RESET  _u(0x0)
#define RVCSR_MENVCFG_FIOM_BITS   _u(0x00000001)
#define RVCSR_MENVCFG_FIOM_MSB    _u(0)
#define RVCSR_MENVCFG_FIOM_LSB    _u(0)
#define RVCSR_MENVCFG_FIOM_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MSTATUSH
// Description : High half of mstatus, hardwired to 0.
#define RVCSR_MSTATUSH_OFFSET _u(0x00000310)
#define RVCSR_MSTATUSH_BITS   _u(0xffffffff)
#define RVCSR_MSTATUSH_RESET  _u(0x00000000)
#define RVCSR_MSTATUSH_MSB    _u(31)
#define RVCSR_MSTATUSH_LSB    _u(0)
#define RVCSR_MSTATUSH_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MENVCFGH
// Description : Machine environment configuration register, high half
//
//               This register is fully reserved, as Hazard3 does not implement
//               the relevant extensions. It is implemented as hardwired-0.
#define RVCSR_MENVCFGH_OFFSET _u(0x0000031a)
#define RVCSR_MENVCFGH_BITS   _u(0x00000000)
#define RVCSR_MENVCFGH_RESET  _u(0x00000000)
#define RVCSR_MENVCFGH_MSB    _u(31)
#define RVCSR_MENVCFGH_LSB    _u(0)
#define RVCSR_MENVCFGH_ACCESS "-"
// =============================================================================
// Register    : RVCSR_MCOUNTINHIBIT
// Description : Count inhibit register for `mcycle`/`minstret`
#define RVCSR_MCOUNTINHIBIT_OFFSET _u(0x00000320)
#define RVCSR_MCOUNTINHIBIT_BITS   _u(0x00000005)
#define RVCSR_MCOUNTINHIBIT_RESET  _u(0x00000005)
// -----------------------------------------------------------------------------
// Field       : RVCSR_MCOUNTINHIBIT_IR
// Description : Inhibit counting of the `minstret` and `minstreth` registers.
//               Set by default to save power.
#define RVCSR_MCOUNTINHIBIT_IR_RESET  _u(0x1)
#define RVCSR_MCOUNTINHIBIT_IR_BITS   _u(0x00000004)
#define RVCSR_MCOUNTINHIBIT_IR_MSB    _u(2)
#define RVCSR_MCOUNTINHIBIT_IR_LSB    _u(2)
#define RVCSR_MCOUNTINHIBIT_IR_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RVCSR_MCOUNTINHIBIT_CY
// Description : Inhibit counting of the `mcycle` and `mcycleh` registers. Set
//               by default to save power.
#define RVCSR_MCOUNTINHIBIT_CY_RESET  _u(0x1)
#define RVCSR_MCOUNTINHIBIT_CY_BITS   _u(0x00000001)
#define RVCSR_MCOUNTINHIBIT_CY_MSB    _u(0)
#define RVCSR_MCOUNTINHIBIT_CY_LSB    _u(0)
#define RVCSR_MCOUNTINHIBIT_CY_ACCESS "RW"
// =============================================================================
// Register    : RVCSR_MHPMEVENT3
// Description : Extended performance event selector, hardwired to 0.
#define RVCSR_MHPMEVENT3_OFFSET _u(0x00000323)
#define RVCSR_MHPMEVENT3_BITS   _u(0xffffffff)
#define RVCSR_MHPMEVENT3_RESET  _u(0x00000000)
#define RVCSR_MHPMEVENT3_MSB    _u(31)
#define RVCSR_MHPMEVENT3_LSB    _u(0)
#define RVCSR_MHPMEVENT3_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMEVENT4
// Description : Extended performance event selector, hardwired to 0.
#define RVCSR_MHPMEVENT4_OFFSET _u(0x00000324)
#define RVCSR_MHPMEVENT4_BITS   _u(0xffffffff)
#define RVCSR_MHPMEVENT4_RESET  _u(0x00000000)
#define RVCSR_MHPMEVENT4_MSB    _u(31)
#define RVCSR_MHPMEVENT4_LSB    _u(0)
#define RVCSR_MHPMEVENT4_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMEVENT5
// Description : Extended performance event selector, hardwired to 0.
#define RVCSR_MHPMEVENT5_OFFSET _u(0x00000325)
#define RVCSR_MHPMEVENT5_BITS   _u(0xffffffff)
#define RVCSR_MHPMEVENT5_RESET  _u(0x00000000)
#define RVCSR_MHPMEVENT5_MSB    _u(31)
#define RVCSR_MHPMEVENT5_LSB    _u(0)
#define RVCSR_MHPMEVENT5_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMEVENT6
// Description : Extended performance event selector, hardwired to 0.
#define RVCSR_MHPMEVENT6_OFFSET _u(0x00000326)
#define RVCSR_MHPMEVENT6_BITS   _u(0xffffffff)
#define RVCSR_MHPMEVENT6_RESET  _u(0x00000000)
#define RVCSR_MHPMEVENT6_MSB    _u(31)
#define RVCSR_MHPMEVENT6_LSB    _u(0)
#define RVCSR_MHPMEVENT6_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMEVENT7
// Description : Extended performance event selector, hardwired to 0.
#define RVCSR_MHPMEVENT7_OFFSET _u(0x00000327)
#define RVCSR_MHPMEVENT7_BITS   _u(0xffffffff)
#define RVCSR_MHPMEVENT7_RESET  _u(0x00000000)
#define RVCSR_MHPMEVENT7_MSB    _u(31)
#define RVCSR_MHPMEVENT7_LSB    _u(0)
#define RVCSR_MHPMEVENT7_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMEVENT8
// Description : Extended performance event selector, hardwired to 0.
#define RVCSR_MHPMEVENT8_OFFSET _u(0x00000328)
#define RVCSR_MHPMEVENT8_BITS   _u(0xffffffff)
#define RVCSR_MHPMEVENT8_RESET  _u(0x00000000)
#define RVCSR_MHPMEVENT8_MSB    _u(31)
#define RVCSR_MHPMEVENT8_LSB    _u(0)
#define RVCSR_MHPMEVENT8_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMEVENT9
// Description : Extended performance event selector, hardwired to 0.
#define RVCSR_MHPMEVENT9_OFFSET _u(0x00000329)
#define RVCSR_MHPMEVENT9_BITS   _u(0xffffffff)
#define RVCSR_MHPMEVENT9_RESET  _u(0x00000000)
#define RVCSR_MHPMEVENT9_MSB    _u(31)
#define RVCSR_MHPMEVENT9_LSB    _u(0)
#define RVCSR_MHPMEVENT9_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMEVENT10
// Description : Extended performance event selector, hardwired to 0.
