Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/rvcsr.h
#define RVCSR_MHPMEVENT10_OFFSET _u(0x0000032a)
#define RVCSR_MHPMEVENT10_BITS   _u(0xffffffff)
#define RVCSR_MHPMEVENT10_RESET  _u(0x00000000)
#define RVCSR_MHPMEVENT10_MSB    _u(31)
#define RVCSR_MHPMEVENT10_LSB    _u(0)
#define RVCSR_MHPMEVENT10_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMEVENT11
// Description : Extended performance event selector, hardwired to 0.
#define RVCSR_MHPMEVENT11_OFFSET _u(0x0000032b)
#define RVCSR_MHPMEVENT11_BITS   _u(0xffffffff)
#define RVCSR_MHPMEVENT11_RESET  _u(0x00000000)
#define RVCSR_MHPMEVENT11_MSB    _u(31)
#define RVCSR_MHPMEVENT11_LSB    _u(0)
#define RVCSR_MHPMEVENT11_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMEVENT12
// Description : Extended performance event selector, hardwired to 0.
#define RVCSR_MHPMEVENT12_OFFSET _u(0x0000032c)
#define RVCSR_MHPMEVENT12_BITS   _u(0xffffffff)
#define RVCSR_MHPMEVENT12_RESET  _u(0x00000000)
#define RVCSR_MHPMEVENT12_MSB    _u(31)
#define RVCSR_MHPMEVENT12_LSB    _u(0)
#define RVCSR_MHPMEVENT12_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMEVENT13
// Description : Extended performance event selector, hardwired to 0.
#define RVCSR_MHPMEVENT13_OFFSET _u(0x0000032d)
#define RVCSR_MHPMEVENT13_BITS   _u(0xffffffff)
#define RVCSR_MHPMEVENT13_RESET  _u(0x00000000)
#define RVCSR_MHPMEVENT13_MSB    _u(31)
#define RVCSR_MHPMEVENT13_LSB    _u(0)
#define RVCSR_MHPMEVENT13_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMEVENT14
// Description : Extended performance event selector, hardwired to 0.
#define RVCSR_MHPMEVENT14_OFFSET _u(0x0000032e)
#define RVCSR_MHPMEVENT14_BITS   _u(0xffffffff)
#define RVCSR_MHPMEVENT14_RESET  _u(0x00000000)
#define RVCSR_MHPMEVENT14_MSB    _u(31)
#define RVCSR_MHPMEVENT14_LSB    _u(0)
#define RVCSR_MHPMEVENT14_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMEVENT15
// Description : Extended performance event selector, hardwired to 0.
#define RVCSR_MHPMEVENT15_OFFSET _u(0x0000032f)
#define RVCSR_MHPMEVENT15_BITS   _u(0xffffffff)
#define RVCSR_MHPMEVENT15_RESET  _u(0x00000000)
#define RVCSR_MHPMEVENT15_MSB    _u(31)
#define RVCSR_MHPMEVENT15_LSB    _u(0)
#define RVCSR_MHPMEVENT15_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMEVENT16
// Description : Extended performance event selector, hardwired to 0.
#define RVCSR_MHPMEVENT16_OFFSET _u(0x00000330)
#define RVCSR_MHPMEVENT16_BITS   _u(0xffffffff)
#define RVCSR_MHPMEVENT16_RESET  _u(0x00000000)
#define RVCSR_MHPMEVENT16_MSB    _u(31)
#define RVCSR_MHPMEVENT16_LSB    _u(0)
#define RVCSR_MHPMEVENT16_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMEVENT17
// Description : Extended performance event selector, hardwired to 0.
#define RVCSR_MHPMEVENT17_OFFSET _u(0x00000331)
#define RVCSR_MHPMEVENT17_BITS   _u(0xffffffff)
#define RVCSR_MHPMEVENT17_RESET  _u(0x00000000)
#define RVCSR_MHPMEVENT17_MSB    _u(31)
#define RVCSR_MHPMEVENT17_LSB    _u(0)
#define RVCSR_MHPMEVENT17_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMEVENT18
// Description : Extended performance event selector, hardwired to 0.
#define RVCSR_MHPMEVENT18_OFFSET _u(0x00000332)
#define RVCSR_MHPMEVENT18_BITS   _u(0xffffffff)
#define RVCSR_MHPMEVENT18_RESET  _u(0x00000000)
#define RVCSR_MHPMEVENT18_MSB    _u(31)
#define RVCSR_MHPMEVENT18_LSB    _u(0)
#define RVCSR_MHPMEVENT18_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMEVENT19
// Description : Extended performance event selector, hardwired to 0.
#define RVCSR_MHPMEVENT19_OFFSET _u(0x00000333)
#define RVCSR_MHPMEVENT19_BITS   _u(0xffffffff)
#define RVCSR_MHPMEVENT19_RESET  _u(0x00000000)
#define RVCSR_MHPMEVENT19_MSB    _u(31)
#define RVCSR_MHPMEVENT19_LSB    _u(0)
#define RVCSR_MHPMEVENT19_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMEVENT20
// Description : Extended performance event selector, hardwired to 0.
#define RVCSR_MHPMEVENT20_OFFSET _u(0x00000334)
#define RVCSR_MHPMEVENT20_BITS   _u(0xffffffff)
#define RVCSR_MHPMEVENT20_RESET  _u(0x00000000)
#define RVCSR_MHPMEVENT20_MSB    _u(31)
#define RVCSR_MHPMEVENT20_LSB    _u(0)
#define RVCSR_MHPMEVENT20_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMEVENT21
// Description : Extended performance event selector, hardwired to 0.
#define RVCSR_MHPMEVENT21_OFFSET _u(0x00000335)
#define RVCSR_MHPMEVENT21_BITS   _u(0xffffffff)
#define RVCSR_MHPMEVENT21_RESET  _u(0x00000000)
#define RVCSR_MHPMEVENT21_MSB    _u(31)
#define RVCSR_MHPMEVENT21_LSB    _u(0)
#define RVCSR_MHPMEVENT21_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMEVENT22
// Description : Extended performance event selector, hardwired to 0.
#define RVCSR_MHPMEVENT22_OFFSET _u(0x00000336)
#define RVCSR_MHPMEVENT22_BITS   _u(0xffffffff)
#define RVCSR_MHPMEVENT22_RESET  _u(0x00000000)
#define RVCSR_MHPMEVENT22_MSB    _u(31)
#define RVCSR_MHPMEVENT22_LSB    _u(0)
#define RVCSR_MHPMEVENT22_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMEVENT23
// Description : Extended performance event selector, hardwired to 0.
#define RVCSR_MHPMEVENT23_OFFSET _u(0x00000337)
#define RVCSR_MHPMEVENT23_BITS   _u(0xffffffff)
#define RVCSR_MHPMEVENT23_RESET  _u(0x00000000)
#define RVCSR_MHPMEVENT23_MSB    _u(31)
#define RVCSR_MHPMEVENT23_LSB    _u(0)
#define RVCSR_MHPMEVENT23_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMEVENT24
// Description : Extended performance event selector, hardwired to 0.
#define RVCSR_MHPMEVENT24_OFFSET _u(0x00000338)
#define RVCSR_MHPMEVENT24_BITS   _u(0xffffffff)
#define RVCSR_MHPMEVENT24_RESET  _u(0x00000000)
#define RVCSR_MHPMEVENT24_MSB    _u(31)
#define RVCSR_MHPMEVENT24_LSB    _u(0)
#define RVCSR_MHPMEVENT24_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMEVENT25
// Description : Extended performance event selector, hardwired to 0.
#define RVCSR_MHPMEVENT25_OFFSET _u(0x00000339)
#define RVCSR_MHPMEVENT25_BITS   _u(0xffffffff)
#define RVCSR_MHPMEVENT25_RESET  _u(0x00000000)
#define RVCSR_MHPMEVENT25_MSB    _u(31)
#define RVCSR_MHPMEVENT25_LSB    _u(0)
#define RVCSR_MHPMEVENT25_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMEVENT26
// Description : Extended performance event selector, hardwired to 0.
#define RVCSR_MHPMEVENT26_OFFSET _u(0x0000033a)
#define RVCSR_MHPMEVENT26_BITS   _u(0xffffffff)
#define RVCSR_MHPMEVENT26_RESET  _u(0x00000000)
#define RVCSR_MHPMEVENT26_MSB    _u(31)
#define RVCSR_MHPMEVENT26_LSB    _u(0)
#define RVCSR_MHPMEVENT26_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMEVENT27
// Description : Extended performance event selector, hardwired to 0.
#define RVCSR_MHPMEVENT27_OFFSET _u(0x0000033b)
#define RVCSR_MHPMEVENT27_BITS   _u(0xffffffff)
#define RVCSR_MHPMEVENT27_RESET  _u(0x00000000)
#define RVCSR_MHPMEVENT27_MSB    _u(31)
#define RVCSR_MHPMEVENT27_LSB    _u(0)
#define RVCSR_MHPMEVENT27_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMEVENT28
// Description : Extended performance event selector, hardwired to 0.
#define RVCSR_MHPMEVENT28_OFFSET _u(0x0000033c)
#define RVCSR_MHPMEVENT28_BITS   _u(0xffffffff)
#define RVCSR_MHPMEVENT28_RESET  _u(0x00000000)
#define RVCSR_MHPMEVENT28_MSB    _u(31)
#define RVCSR_MHPMEVENT28_LSB    _u(0)
#define RVCSR_MHPMEVENT28_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMEVENT29
// Description : Extended performance event selector, hardwired to 0.
#define RVCSR_MHPMEVENT29_OFFSET _u(0x0000033d)
#define RVCSR_MHPMEVENT29_BITS   _u(0xffffffff)
#define RVCSR_MHPMEVENT29_RESET  _u(0x00000000)
#define RVCSR_MHPMEVENT29_MSB    _u(31)
#define RVCSR_MHPMEVENT29_LSB    _u(0)
#define RVCSR_MHPMEVENT29_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMEVENT30
// Description : Extended performance event selector, hardwired to 0.
#define RVCSR_MHPMEVENT30_OFFSET _u(0x0000033e)
#define RVCSR_MHPMEVENT30_BITS   _u(0xffffffff)
#define RVCSR_MHPMEVENT30_RESET  _u(0x00000000)
#define RVCSR_MHPMEVENT30_MSB    _u(31)
#define RVCSR_MHPMEVENT30_LSB    _u(0)
#define RVCSR_MHPMEVENT30_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMEVENT31
// Description : Extended performance event selector, hardwired to 0.
#define RVCSR_MHPMEVENT31_OFFSET _u(0x0000033f)
#define RVCSR_MHPMEVENT31_BITS   _u(0xffffffff)
#define RVCSR_MHPMEVENT31_RESET  _u(0x00000000)
#define RVCSR_MHPMEVENT31_MSB    _u(31)
#define RVCSR_MHPMEVENT31_LSB    _u(0)
#define RVCSR_MHPMEVENT31_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MSCRATCH
// Description : Scratch register for machine trap handlers.
//
//               32-bit read/write register with no specific hardware function.
//               Software may use this to do a fast save/restore of a core
//               register in a trap handler.
#define RVCSR_MSCRATCH_OFFSET _u(0x00000340)
#define RVCSR_MSCRATCH_BITS   _u(0xffffffff)
#define RVCSR_MSCRATCH_RESET  _u(0x00000000)
#define RVCSR_MSCRATCH_MSB    _u(31)
#define RVCSR_MSCRATCH_LSB    _u(0)
#define RVCSR_MSCRATCH_ACCESS "RW"
// =============================================================================
// Register    : RVCSR_MEPC
// Description : Machine exception program counter.
//
//               When entering a trap, the current value of the program counter
//               is recorded here. When executing an `mret`, the processor jumps
//               to `mepc`. Can also be read and written by software.
#define RVCSR_MEPC_OFFSET _u(0x00000341)
#define RVCSR_MEPC_BITS   _u(0xfffffffc)
#define RVCSR_MEPC_RESET  _u(0x00000000)
#define RVCSR_MEPC_MSB    _u(31)
#define RVCSR_MEPC_LSB    _u(2)
#define RVCSR_MEPC_ACCESS "RW"
// =============================================================================
// Register    : RVCSR_MCAUSE
// Description : Machine trap cause. Set when entering a trap to indicate the
//               reason for the trap. Readable and writable by software.
#define RVCSR_MCAUSE_OFFSET _u(0x00000342)
#define RVCSR_MCAUSE_BITS   _u(0x8000000f)
#define RVCSR_MCAUSE_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : RVCSR_MCAUSE_INTERRUPT
// Description : If 1, the trap was caused by an interrupt. If 0, it was caused
//               by an exception.
#define RVCSR_MCAUSE_INTERRUPT_RESET  _u(0x0)
#define RVCSR_MCAUSE_INTERRUPT_BITS   _u(0x80000000)
#define RVCSR_MCAUSE_INTERRUPT_MSB    _u(31)
#define RVCSR_MCAUSE_INTERRUPT_LSB    _u(31)
#define RVCSR_MCAUSE_INTERRUPT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RVCSR_MCAUSE_CODE
// Description : If `interrupt` is set, `code` indicates the index of the bit in
//               mip that caused the trap (3=soft IRQ, 7=timer IRQ, 11=external
//               IRQ). Otherwise, `code` is set according to the cause of the
//               exception.
//               0x0 -> Instruction fetch was misaligned. Will never fire on RP2350, since the C extension is enabled.
//               0x1 -> Instruction access fault. Instruction fetch failed a PMP check, or encountered a downstream bus fault, and then passed the point of no speculation.
//               0x2 -> Illegal instruction was executed (including illegal CSR accesses)
//               0x3 -> Breakpoint. An ebreak instruction was executed when the relevant dcsr.ebreak bit was clear.
//               0x4 -> Load address misaligned. Hazard3 requires natural alignment of all accesses.
//               0x5 -> Load access fault. A load failed a PMP check, or encountered a downstream bus error.
//               0x6 -> Store/AMO address misaligned. Hazard3 requires natural alignment of all accesses.
//               0x7 -> Store/AMO access fault. A store/AMO failed a PMP check, or encountered a downstream bus error. Also set if an AMO is attempted on a region that does not support atomics (on RP2350, anything but SRAM).
//               0x8 -> Environment call from U-mode.
//               0xb -> Environment call from M-mode.
#define RVCSR_MCAUSE_CODE_RESET  _u(0x0)
#define RVCSR_MCAUSE_CODE_BITS   _u(0x0000000f)
#define RVCSR_MCAUSE_CODE_MSB    _u(3)
#define RVCSR_MCAUSE_CODE_LSB    _u(0)
#define RVCSR_MCAUSE_CODE_ACCESS "RW"
#define RVCSR_MCAUSE_CODE_VALUE_INSTR_ALIGN _u(0x0)
#define RVCSR_MCAUSE_CODE_VALUE_INSTR_FAULT _u(0x1)
#define RVCSR_MCAUSE_CODE_VALUE_ILLEGAL_INSTR _u(0x2)
#define RVCSR_MCAUSE_CODE_VALUE_BREAKPOINT _u(0x3)
#define RVCSR_MCAUSE_CODE_VALUE_LOAD_ALIGN _u(0x4)
#define RVCSR_MCAUSE_CODE_VALUE_LOAD_FAULT _u(0x5)
#define RVCSR_MCAUSE_CODE_VALUE_STORE_ALIGN _u(0x6)
#define RVCSR_MCAUSE_CODE_VALUE_STORE_FAULT _u(0x7)
#define RVCSR_MCAUSE_CODE_VALUE_U_ECALL _u(0x8)
#define RVCSR_MCAUSE_CODE_VALUE_M_ECALL _u(0xb)
// =============================================================================
// Register    : RVCSR_MTVAL
// Description : Machine bad address or instruction. Hardwired to zero.
#define RVCSR_MTVAL_OFFSET _u(0x00000343)
#define RVCSR_MTVAL_BITS   _u(0xffffffff)
#define RVCSR_MTVAL_RESET  _u(0x00000000)
#define RVCSR_MTVAL_MSB    _u(31)
#define RVCSR_MTVAL_LSB    _u(0)
#define RVCSR_MTVAL_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MIP
// Description : Machine interrupt pending
#define RVCSR_MIP_OFFSET _u(0x00000344)
#define RVCSR_MIP_BITS   _u(0x00000888)
#define RVCSR_MIP_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : RVCSR_MIP_MEIP
// Description : External interrupt pending. The processor transfers to the
//               external interrupt vector when `mie.meie`, `mip.meip` and
//               `mstatus.mie` are all 1.
//
//               Hazard3 has internal registers to individually filter which
//               external IRQs appear in `meip`. When `meip` is 1, this
//               indicates there is at least one external interrupt which is
//               asserted (hence pending in `mieipa`), enabled in `meiea`, and
//               of priority greater than or equal to the current preemption
//               level in `meicontext.preempt`.
#define RVCSR_MIP_MEIP_RESET  _u(0x0)
#define RVCSR_MIP_MEIP_BITS   _u(0x00000800)
#define RVCSR_MIP_MEIP_MSB    _u(11)
#define RVCSR_MIP_MEIP_LSB    _u(11)
#define RVCSR_MIP_MEIP_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RVCSR_MIP_MTIP
// Description : Timer interrupt pending. The processor transfers to the timer
//               interrupt vector when `mie.mtie`, `mip.mtip` and `mstatus.mie`
//               are all 1, unless a software or external interrupt request is
//               also both pending and enabled at this time.
#define RVCSR_MIP_MTIP_RESET  _u(0x0)
#define RVCSR_MIP_MTIP_BITS   _u(0x00000080)
#define RVCSR_MIP_MTIP_MSB    _u(7)
#define RVCSR_MIP_MTIP_LSB    _u(7)
#define RVCSR_MIP_MTIP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RVCSR_MIP_MSIP
// Description : Software interrupt pending. The processor transfers to the
//               software interrupt vector when `mie.msie`, `mip.msip` and
//               `mstatus.mie` are all 1, unless an external interrupt request
//               is also both pending and enabled at this time.
#define RVCSR_MIP_MSIP_RESET  _u(0x0)
#define RVCSR_MIP_MSIP_BITS   _u(0x00000008)
#define RVCSR_MIP_MSIP_MSB    _u(3)
#define RVCSR_MIP_MSIP_LSB    _u(3)
#define RVCSR_MIP_MSIP_ACCESS "RW"
// =============================================================================
// Register    : RVCSR_PMPCFG0
// Description : Physical memory protection configuration for regions 0 through
//               3
#define RVCSR_PMPCFG0_OFFSET _u(0x000003a0)
#define RVCSR_PMPCFG0_BITS   _u(0x9f9f9f9f)
#define RVCSR_PMPCFG0_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG0_R3_L
// Description : Lock region 3, and apply it to M-mode as well as U-mode.
#define RVCSR_PMPCFG0_R3_L_RESET  _u(0x0)
#define RVCSR_PMPCFG0_R3_L_BITS   _u(0x80000000)
#define RVCSR_PMPCFG0_R3_L_MSB    _u(31)
#define RVCSR_PMPCFG0_R3_L_LSB    _u(31)
#define RVCSR_PMPCFG0_R3_L_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG0_R3_A
// Description : Address matching type for region 3. Writing an unsupported
//               value (TOR) will set the region to OFF.
//               0x0 -> Disable region
//               0x2 -> Naturally aligned 4-byte
//               0x3 -> Naturally aligned power-of-two (8 bytes to 4 GiB)
#define RVCSR_PMPCFG0_R3_A_RESET  _u(0x0)
#define RVCSR_PMPCFG0_R3_A_BITS   _u(0x18000000)
#define RVCSR_PMPCFG0_R3_A_MSB    _u(28)
#define RVCSR_PMPCFG0_R3_A_LSB    _u(27)
#define RVCSR_PMPCFG0_R3_A_ACCESS "RW"
#define RVCSR_PMPCFG0_R3_A_VALUE_OFF _u(0x0)
#define RVCSR_PMPCFG0_R3_A_VALUE_NA4 _u(0x2)
#define RVCSR_PMPCFG0_R3_A_VALUE_NAPOT _u(0x3)
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG0_R3_R
// Description : Read permission for region 3. Note R and X are transposed from
//               the standard bit order due to erratum RP2350-E6.
#define RVCSR_PMPCFG0_R3_R_RESET  _u(0x0)
#define RVCSR_PMPCFG0_R3_R_BITS   _u(0x04000000)
#define RVCSR_PMPCFG0_R3_R_MSB    _u(26)
#define RVCSR_PMPCFG0_R3_R_LSB    _u(26)
#define RVCSR_PMPCFG0_R3_R_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG0_R3_W
// Description : Write permission for region 3
#define RVCSR_PMPCFG0_R3_W_RESET  _u(0x0)
#define RVCSR_PMPCFG0_R3_W_BITS   _u(0x02000000)
#define RVCSR_PMPCFG0_R3_W_MSB    _u(25)
#define RVCSR_PMPCFG0_R3_W_LSB    _u(25)
#define RVCSR_PMPCFG0_R3_W_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG0_R3_X
// Description : Execute permission for region 3. Note R and X are transposed
//               from the standard bit order due to erratum RP2350-E6.
#define RVCSR_PMPCFG0_R3_X_RESET  _u(0x0)
#define RVCSR_PMPCFG0_R3_X_BITS   _u(0x01000000)
#define RVCSR_PMPCFG0_R3_X_MSB    _u(24)
#define RVCSR_PMPCFG0_R3_X_LSB    _u(24)
#define RVCSR_PMPCFG0_R3_X_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG0_R2_L
// Description : Lock region 2, and apply it to M-mode as well as U-mode.
#define RVCSR_PMPCFG0_R2_L_RESET  _u(0x0)
#define RVCSR_PMPCFG0_R2_L_BITS   _u(0x00800000)
#define RVCSR_PMPCFG0_R2_L_MSB    _u(23)
#define RVCSR_PMPCFG0_R2_L_LSB    _u(23)
#define RVCSR_PMPCFG0_R2_L_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG0_R2_A
// Description : Address matching type for region 2. Writing an unsupported
//               value (TOR) will set the region to OFF.
//               0x0 -> Disable region
//               0x2 -> Naturally aligned 4-byte
//               0x3 -> Naturally aligned power-of-two (8 bytes to 4 GiB)
#define RVCSR_PMPCFG0_R2_A_RESET  _u(0x0)
#define RVCSR_PMPCFG0_R2_A_BITS   _u(0x00180000)
#define RVCSR_PMPCFG0_R2_A_MSB    _u(20)
#define RVCSR_PMPCFG0_R2_A_LSB    _u(19)
#define RVCSR_PMPCFG0_R2_A_ACCESS "RW"
#define RVCSR_PMPCFG0_R2_A_VALUE_OFF _u(0x0)
#define RVCSR_PMPCFG0_R2_A_VALUE_NA4 _u(0x2)
#define RVCSR_PMPCFG0_R2_A_VALUE_NAPOT _u(0x3)
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG0_R2_R
// Description : Read permission for region 2. Note R and X are transposed from
//               the standard bit order due to erratum RP2350-E6.
#define RVCSR_PMPCFG0_R2_R_RESET  _u(0x0)
#define RVCSR_PMPCFG0_R2_R_BITS   _u(0x00040000)
#define RVCSR_PMPCFG0_R2_R_MSB    _u(18)
#define RVCSR_PMPCFG0_R2_R_LSB    _u(18)
#define RVCSR_PMPCFG0_R2_R_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG0_R2_W
// Description : Write permission for region 2
#define RVCSR_PMPCFG0_R2_W_RESET  _u(0x0)
#define RVCSR_PMPCFG0_R2_W_BITS   _u(0x00020000)
#define RVCSR_PMPCFG0_R2_W_MSB    _u(17)
#define RVCSR_PMPCFG0_R2_W_LSB    _u(17)
#define RVCSR_PMPCFG0_R2_W_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG0_R2_X
// Description : Execute permission for region 2. Note R and X are transposed
//               from the standard bit order due to erratum RP2350-E6.
#define RVCSR_PMPCFG0_R2_X_RESET  _u(0x0)
#define RVCSR_PMPCFG0_R2_X_BITS   _u(0x00010000)
#define RVCSR_PMPCFG0_R2_X_MSB    _u(16)
#define RVCSR_PMPCFG0_R2_X_LSB    _u(16)
#define RVCSR_PMPCFG0_R2_X_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG0_R1_L
// Description : Lock region 1, and apply it to M-mode as well as U-mode.
#define RVCSR_PMPCFG0_R1_L_RESET  _u(0x0)
#define RVCSR_PMPCFG0_R1_L_BITS   _u(0x00008000)
#define RVCSR_PMPCFG0_R1_L_MSB    _u(15)
#define RVCSR_PMPCFG0_R1_L_LSB    _u(15)
#define RVCSR_PMPCFG0_R1_L_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG0_R1_A
// Description : Address matching type for region 1. Writing an unsupported
//               value (TOR) will set the region to OFF.
//               0x0 -> Disable region
//               0x2 -> Naturally aligned 4-byte
//               0x3 -> Naturally aligned power-of-two (8 bytes to 4 GiB)
#define RVCSR_PMPCFG0_R1_A_RESET  _u(0x0)
#define RVCSR_PMPCFG0_R1_A_BITS   _u(0x00001800)
#define RVCSR_PMPCFG0_R1_A_MSB    _u(12)
#define RVCSR_PMPCFG0_R1_A_LSB    _u(11)
#define RVCSR_PMPCFG0_R1_A_ACCESS "RW"
#define RVCSR_PMPCFG0_R1_A_VALUE_OFF _u(0x0)
#define RVCSR_PMPCFG0_R1_A_VALUE_NA4 _u(0x2)
#define RVCSR_PMPCFG0_R1_A_VALUE_NAPOT _u(0x3)
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG0_R1_R
// Description : Read permission for region 1. Note R and X are transposed from
//               the standard bit order due to erratum RP2350-E6.
#define RVCSR_PMPCFG0_R1_R_RESET  _u(0x0)
#define RVCSR_PMPCFG0_R1_R_BITS   _u(0x00000400)
#define RVCSR_PMPCFG0_R1_R_MSB    _u(10)
#define RVCSR_PMPCFG0_R1_R_LSB    _u(10)
#define RVCSR_PMPCFG0_R1_R_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG0_R1_W
// Description : Write permission for region 1
#define RVCSR_PMPCFG0_R1_W_RESET  _u(0x0)
