Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/rvcsr.h
#define RVCSR_PMPCFG0_R1_W_BITS   _u(0x00000200)
#define RVCSR_PMPCFG0_R1_W_MSB    _u(9)
#define RVCSR_PMPCFG0_R1_W_LSB    _u(9)
#define RVCSR_PMPCFG0_R1_W_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG0_R1_X
// Description : Execute permission for region 1. Note R and X are transposed
//               from the standard bit order due to erratum RP2350-E6.
#define RVCSR_PMPCFG0_R1_X_RESET  _u(0x0)
#define RVCSR_PMPCFG0_R1_X_BITS   _u(0x00000100)
#define RVCSR_PMPCFG0_R1_X_MSB    _u(8)
#define RVCSR_PMPCFG0_R1_X_LSB    _u(8)
#define RVCSR_PMPCFG0_R1_X_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG0_R0_L
// Description : Lock region 0, and apply it to M-mode as well as U-mode.
#define RVCSR_PMPCFG0_R0_L_RESET  _u(0x0)
#define RVCSR_PMPCFG0_R0_L_BITS   _u(0x00000080)
#define RVCSR_PMPCFG0_R0_L_MSB    _u(7)
#define RVCSR_PMPCFG0_R0_L_LSB    _u(7)
#define RVCSR_PMPCFG0_R0_L_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG0_R0_A
// Description : Address matching type for region 0. Writing an unsupported
//               value (TOR) will set the region to OFF.
//               0x0 -> Disable region
//               0x2 -> Naturally aligned 4-byte
//               0x3 -> Naturally aligned power-of-two (8 bytes to 4 GiB)
#define RVCSR_PMPCFG0_R0_A_RESET  _u(0x0)
#define RVCSR_PMPCFG0_R0_A_BITS   _u(0x00000018)
#define RVCSR_PMPCFG0_R0_A_MSB    _u(4)
#define RVCSR_PMPCFG0_R0_A_LSB    _u(3)
#define RVCSR_PMPCFG0_R0_A_ACCESS "RW"
#define RVCSR_PMPCFG0_R0_A_VALUE_OFF _u(0x0)
#define RVCSR_PMPCFG0_R0_A_VALUE_NA4 _u(0x2)
#define RVCSR_PMPCFG0_R0_A_VALUE_NAPOT _u(0x3)
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG0_R0_R
// Description : Read permission for region 0. Note R and X are transposed from
//               the standard bit order due to erratum RP2350-E6.
#define RVCSR_PMPCFG0_R0_R_RESET  _u(0x0)
#define RVCSR_PMPCFG0_R0_R_BITS   _u(0x00000004)
#define RVCSR_PMPCFG0_R0_R_MSB    _u(2)
#define RVCSR_PMPCFG0_R0_R_LSB    _u(2)
#define RVCSR_PMPCFG0_R0_R_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG0_R0_W
// Description : Write permission for region 0
#define RVCSR_PMPCFG0_R0_W_RESET  _u(0x0)
#define RVCSR_PMPCFG0_R0_W_BITS   _u(0x00000002)
#define RVCSR_PMPCFG0_R0_W_MSB    _u(1)
#define RVCSR_PMPCFG0_R0_W_LSB    _u(1)
#define RVCSR_PMPCFG0_R0_W_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG0_R0_X
// Description : Execute permission for region 0. Note R and X are transposed
//               from the standard bit order due to erratum RP2350-E6.
#define RVCSR_PMPCFG0_R0_X_RESET  _u(0x0)
#define RVCSR_PMPCFG0_R0_X_BITS   _u(0x00000001)
#define RVCSR_PMPCFG0_R0_X_MSB    _u(0)
#define RVCSR_PMPCFG0_R0_X_LSB    _u(0)
#define RVCSR_PMPCFG0_R0_X_ACCESS "RW"
// =============================================================================
// Register    : RVCSR_PMPCFG1
// Description : Physical memory protection configuration for regions 4 through
//               7
#define RVCSR_PMPCFG1_OFFSET _u(0x000003a1)
#define RVCSR_PMPCFG1_BITS   _u(0x9f9f9f9f)
#define RVCSR_PMPCFG1_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG1_R7_L
// Description : Lock region 7, and apply it to M-mode as well as U-mode.
#define RVCSR_PMPCFG1_R7_L_RESET  _u(0x0)
#define RVCSR_PMPCFG1_R7_L_BITS   _u(0x80000000)
#define RVCSR_PMPCFG1_R7_L_MSB    _u(31)
#define RVCSR_PMPCFG1_R7_L_LSB    _u(31)
#define RVCSR_PMPCFG1_R7_L_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG1_R7_A
// Description : Address matching type for region 7. Writing an unsupported
//               value (TOR) will set the region to OFF.
//               0x0 -> Disable region
//               0x2 -> Naturally aligned 4-byte
//               0x3 -> Naturally aligned power-of-two (8 bytes to 4 GiB)
#define RVCSR_PMPCFG1_R7_A_RESET  _u(0x0)
#define RVCSR_PMPCFG1_R7_A_BITS   _u(0x18000000)
#define RVCSR_PMPCFG1_R7_A_MSB    _u(28)
#define RVCSR_PMPCFG1_R7_A_LSB    _u(27)
#define RVCSR_PMPCFG1_R7_A_ACCESS "RW"
#define RVCSR_PMPCFG1_R7_A_VALUE_OFF _u(0x0)
#define RVCSR_PMPCFG1_R7_A_VALUE_NA4 _u(0x2)
#define RVCSR_PMPCFG1_R7_A_VALUE_NAPOT _u(0x3)
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG1_R7_R
// Description : Read permission for region 7. Note R and X are transposed from
//               the standard bit order due to erratum RP2350-E6.
#define RVCSR_PMPCFG1_R7_R_RESET  _u(0x0)
#define RVCSR_PMPCFG1_R7_R_BITS   _u(0x04000000)
#define RVCSR_PMPCFG1_R7_R_MSB    _u(26)
#define RVCSR_PMPCFG1_R7_R_LSB    _u(26)
#define RVCSR_PMPCFG1_R7_R_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG1_R7_W
// Description : Write permission for region 7
#define RVCSR_PMPCFG1_R7_W_RESET  _u(0x0)
#define RVCSR_PMPCFG1_R7_W_BITS   _u(0x02000000)
#define RVCSR_PMPCFG1_R7_W_MSB    _u(25)
#define RVCSR_PMPCFG1_R7_W_LSB    _u(25)
#define RVCSR_PMPCFG1_R7_W_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG1_R7_X
// Description : Execute permission for region 7. Note R and X are transposed
//               from the standard bit order due to erratum RP2350-E6.
#define RVCSR_PMPCFG1_R7_X_RESET  _u(0x0)
#define RVCSR_PMPCFG1_R7_X_BITS   _u(0x01000000)
#define RVCSR_PMPCFG1_R7_X_MSB    _u(24)
#define RVCSR_PMPCFG1_R7_X_LSB    _u(24)
#define RVCSR_PMPCFG1_R7_X_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG1_R6_L
// Description : Lock region 6, and apply it to M-mode as well as U-mode.
#define RVCSR_PMPCFG1_R6_L_RESET  _u(0x0)
#define RVCSR_PMPCFG1_R6_L_BITS   _u(0x00800000)
#define RVCSR_PMPCFG1_R6_L_MSB    _u(23)
#define RVCSR_PMPCFG1_R6_L_LSB    _u(23)
#define RVCSR_PMPCFG1_R6_L_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG1_R6_A
// Description : Address matching type for region 6. Writing an unsupported
//               value (TOR) will set the region to OFF.
//               0x0 -> Disable region
//               0x2 -> Naturally aligned 4-byte
//               0x3 -> Naturally aligned power-of-two (8 bytes to 4 GiB)
#define RVCSR_PMPCFG1_R6_A_RESET  _u(0x0)
#define RVCSR_PMPCFG1_R6_A_BITS   _u(0x00180000)
#define RVCSR_PMPCFG1_R6_A_MSB    _u(20)
#define RVCSR_PMPCFG1_R6_A_LSB    _u(19)
#define RVCSR_PMPCFG1_R6_A_ACCESS "RW"
#define RVCSR_PMPCFG1_R6_A_VALUE_OFF _u(0x0)
#define RVCSR_PMPCFG1_R6_A_VALUE_NA4 _u(0x2)
#define RVCSR_PMPCFG1_R6_A_VALUE_NAPOT _u(0x3)
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG1_R6_R
// Description : Read permission for region 6. Note R and X are transposed from
//               the standard bit order due to erratum RP2350-E6.
#define RVCSR_PMPCFG1_R6_R_RESET  _u(0x0)
#define RVCSR_PMPCFG1_R6_R_BITS   _u(0x00040000)
#define RVCSR_PMPCFG1_R6_R_MSB    _u(18)
#define RVCSR_PMPCFG1_R6_R_LSB    _u(18)
#define RVCSR_PMPCFG1_R6_R_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG1_R6_W
// Description : Write permission for region 6
#define RVCSR_PMPCFG1_R6_W_RESET  _u(0x0)
#define RVCSR_PMPCFG1_R6_W_BITS   _u(0x00020000)
#define RVCSR_PMPCFG1_R6_W_MSB    _u(17)
#define RVCSR_PMPCFG1_R6_W_LSB    _u(17)
#define RVCSR_PMPCFG1_R6_W_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG1_R6_X
// Description : Execute permission for region 6. Note R and X are transposed
//               from the standard bit order due to erratum RP2350-E6.
#define RVCSR_PMPCFG1_R6_X_RESET  _u(0x0)
#define RVCSR_PMPCFG1_R6_X_BITS   _u(0x00010000)
#define RVCSR_PMPCFG1_R6_X_MSB    _u(16)
#define RVCSR_PMPCFG1_R6_X_LSB    _u(16)
#define RVCSR_PMPCFG1_R6_X_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG1_R5_L
// Description : Lock region 5, and apply it to M-mode as well as U-mode.
#define RVCSR_PMPCFG1_R5_L_RESET  _u(0x0)
#define RVCSR_PMPCFG1_R5_L_BITS   _u(0x00008000)
#define RVCSR_PMPCFG1_R5_L_MSB    _u(15)
#define RVCSR_PMPCFG1_R5_L_LSB    _u(15)
#define RVCSR_PMPCFG1_R5_L_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG1_R5_A
// Description : Address matching type for region 5. Writing an unsupported
//               value (TOR) will set the region to OFF.
//               0x0 -> Disable region
//               0x2 -> Naturally aligned 4-byte
//               0x3 -> Naturally aligned power-of-two (8 bytes to 4 GiB)
#define RVCSR_PMPCFG1_R5_A_RESET  _u(0x0)
#define RVCSR_PMPCFG1_R5_A_BITS   _u(0x00001800)
#define RVCSR_PMPCFG1_R5_A_MSB    _u(12)
#define RVCSR_PMPCFG1_R5_A_LSB    _u(11)
#define RVCSR_PMPCFG1_R5_A_ACCESS "RW"
#define RVCSR_PMPCFG1_R5_A_VALUE_OFF _u(0x0)
#define RVCSR_PMPCFG1_R5_A_VALUE_NA4 _u(0x2)
#define RVCSR_PMPCFG1_R5_A_VALUE_NAPOT _u(0x3)
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG1_R5_R
// Description : Read permission for region 5. Note R and X are transposed from
//               the standard bit order due to erratum RP2350-E6.
#define RVCSR_PMPCFG1_R5_R_RESET  _u(0x0)
#define RVCSR_PMPCFG1_R5_R_BITS   _u(0x00000400)
#define RVCSR_PMPCFG1_R5_R_MSB    _u(10)
#define RVCSR_PMPCFG1_R5_R_LSB    _u(10)
#define RVCSR_PMPCFG1_R5_R_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG1_R5_W
// Description : Write permission for region 5
#define RVCSR_PMPCFG1_R5_W_RESET  _u(0x0)
#define RVCSR_PMPCFG1_R5_W_BITS   _u(0x00000200)
#define RVCSR_PMPCFG1_R5_W_MSB    _u(9)
#define RVCSR_PMPCFG1_R5_W_LSB    _u(9)
#define RVCSR_PMPCFG1_R5_W_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG1_R5_X
// Description : Execute permission for region 5. Note R and X are transposed
//               from the standard bit order due to erratum RP2350-E6.
#define RVCSR_PMPCFG1_R5_X_RESET  _u(0x0)
#define RVCSR_PMPCFG1_R5_X_BITS   _u(0x00000100)
#define RVCSR_PMPCFG1_R5_X_MSB    _u(8)
#define RVCSR_PMPCFG1_R5_X_LSB    _u(8)
#define RVCSR_PMPCFG1_R5_X_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG1_R4_L
// Description : Lock region 4, and apply it to M-mode as well as U-mode.
#define RVCSR_PMPCFG1_R4_L_RESET  _u(0x0)
#define RVCSR_PMPCFG1_R4_L_BITS   _u(0x00000080)
#define RVCSR_PMPCFG1_R4_L_MSB    _u(7)
#define RVCSR_PMPCFG1_R4_L_LSB    _u(7)
#define RVCSR_PMPCFG1_R4_L_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG1_R4_A
// Description : Address matching type for region 4. Writing an unsupported
//               value (TOR) will set the region to OFF.
//               0x0 -> Disable region
//               0x2 -> Naturally aligned 4-byte
//               0x3 -> Naturally aligned power-of-two (8 bytes to 4 GiB)
#define RVCSR_PMPCFG1_R4_A_RESET  _u(0x0)
#define RVCSR_PMPCFG1_R4_A_BITS   _u(0x00000018)
#define RVCSR_PMPCFG1_R4_A_MSB    _u(4)
#define RVCSR_PMPCFG1_R4_A_LSB    _u(3)
#define RVCSR_PMPCFG1_R4_A_ACCESS "RW"
#define RVCSR_PMPCFG1_R4_A_VALUE_OFF _u(0x0)
#define RVCSR_PMPCFG1_R4_A_VALUE_NA4 _u(0x2)
#define RVCSR_PMPCFG1_R4_A_VALUE_NAPOT _u(0x3)
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG1_R4_R
// Description : Read permission for region 4. Note R and X are transposed from
//               the standard bit order due to erratum RP2350-E6.
#define RVCSR_PMPCFG1_R4_R_RESET  _u(0x0)
#define RVCSR_PMPCFG1_R4_R_BITS   _u(0x00000004)
#define RVCSR_PMPCFG1_R4_R_MSB    _u(2)
#define RVCSR_PMPCFG1_R4_R_LSB    _u(2)
#define RVCSR_PMPCFG1_R4_R_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG1_R4_W
// Description : Write permission for region 4
#define RVCSR_PMPCFG1_R4_W_RESET  _u(0x0)
#define RVCSR_PMPCFG1_R4_W_BITS   _u(0x00000002)
#define RVCSR_PMPCFG1_R4_W_MSB    _u(1)
#define RVCSR_PMPCFG1_R4_W_LSB    _u(1)
#define RVCSR_PMPCFG1_R4_W_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG1_R4_X
// Description : Execute permission for region 4. Note R and X are transposed
//               from the standard bit order due to erratum RP2350-E6.
#define RVCSR_PMPCFG1_R4_X_RESET  _u(0x0)
#define RVCSR_PMPCFG1_R4_X_BITS   _u(0x00000001)
#define RVCSR_PMPCFG1_R4_X_MSB    _u(0)
#define RVCSR_PMPCFG1_R4_X_LSB    _u(0)
#define RVCSR_PMPCFG1_R4_X_ACCESS "RW"
// =============================================================================
// Register    : RVCSR_PMPCFG2
// Description : Physical memory protection configuration for regions 8 through
//               11
#define RVCSR_PMPCFG2_OFFSET _u(0x000003a2)
#define RVCSR_PMPCFG2_BITS   _u(0x9f9f9f9f)
#define RVCSR_PMPCFG2_RESET  _u(0x001f1f1f)
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG2_R11_L
// Description : Lock region 11, and apply it to M-mode as well as U-mode.
#define RVCSR_PMPCFG2_R11_L_RESET  _u(0x0)
#define RVCSR_PMPCFG2_R11_L_BITS   _u(0x80000000)
#define RVCSR_PMPCFG2_R11_L_MSB    _u(31)
#define RVCSR_PMPCFG2_R11_L_LSB    _u(31)
#define RVCSR_PMPCFG2_R11_L_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG2_R11_A
// Description : Address matching type for region 11. Writing an unsupported
//               value (TOR) will set the region to OFF.
//               0x0 -> Disable region
//               0x2 -> Naturally aligned 4-byte
//               0x3 -> Naturally aligned power-of-two (8 bytes to 4 GiB)
#define RVCSR_PMPCFG2_R11_A_RESET  _u(0x0)
#define RVCSR_PMPCFG2_R11_A_BITS   _u(0x18000000)
#define RVCSR_PMPCFG2_R11_A_MSB    _u(28)
#define RVCSR_PMPCFG2_R11_A_LSB    _u(27)
#define RVCSR_PMPCFG2_R11_A_ACCESS "RO"
#define RVCSR_PMPCFG2_R11_A_VALUE_OFF _u(0x0)
#define RVCSR_PMPCFG2_R11_A_VALUE_NA4 _u(0x2)
#define RVCSR_PMPCFG2_R11_A_VALUE_NAPOT _u(0x3)
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG2_R11_R
// Description : Read permission for region 11. Note R and X are transposed from
//               the standard bit order due to erratum RP2350-E6.
#define RVCSR_PMPCFG2_R11_R_RESET  _u(0x0)
#define RVCSR_PMPCFG2_R11_R_BITS   _u(0x04000000)
#define RVCSR_PMPCFG2_R11_R_MSB    _u(26)
#define RVCSR_PMPCFG2_R11_R_LSB    _u(26)
#define RVCSR_PMPCFG2_R11_R_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG2_R11_W
// Description : Write permission for region 11
#define RVCSR_PMPCFG2_R11_W_RESET  _u(0x0)
#define RVCSR_PMPCFG2_R11_W_BITS   _u(0x02000000)
#define RVCSR_PMPCFG2_R11_W_MSB    _u(25)
#define RVCSR_PMPCFG2_R11_W_LSB    _u(25)
#define RVCSR_PMPCFG2_R11_W_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG2_R11_X
// Description : Execute permission for region 11. Note R and X are transposed
//               from the standard bit order due to erratum RP2350-E6.
#define RVCSR_PMPCFG2_R11_X_RESET  _u(0x0)
#define RVCSR_PMPCFG2_R11_X_BITS   _u(0x01000000)
#define RVCSR_PMPCFG2_R11_X_MSB    _u(24)
#define RVCSR_PMPCFG2_R11_X_LSB    _u(24)
#define RVCSR_PMPCFG2_R11_X_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG2_R10_L
// Description : Lock region 10, and apply it to M-mode as well as U-mode.
#define RVCSR_PMPCFG2_R10_L_RESET  _u(0x0)
#define RVCSR_PMPCFG2_R10_L_BITS   _u(0x00800000)
#define RVCSR_PMPCFG2_R10_L_MSB    _u(23)
#define RVCSR_PMPCFG2_R10_L_LSB    _u(23)
#define RVCSR_PMPCFG2_R10_L_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG2_R10_A
// Description : Address matching type for region 10. Writing an unsupported
//               value (TOR) will set the region to OFF.
//               0x0 -> Disable region
//               0x2 -> Naturally aligned 4-byte
//               0x3 -> Naturally aligned power-of-two (8 bytes to 4 GiB)
#define RVCSR_PMPCFG2_R10_A_RESET  _u(0x3)
#define RVCSR_PMPCFG2_R10_A_BITS   _u(0x00180000)
#define RVCSR_PMPCFG2_R10_A_MSB    _u(20)
#define RVCSR_PMPCFG2_R10_A_LSB    _u(19)
#define RVCSR_PMPCFG2_R10_A_ACCESS "RO"
#define RVCSR_PMPCFG2_R10_A_VALUE_OFF _u(0x0)
#define RVCSR_PMPCFG2_R10_A_VALUE_NA4 _u(0x2)
#define RVCSR_PMPCFG2_R10_A_VALUE_NAPOT _u(0x3)
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG2_R10_R
// Description : Read permission for region 10. Note R and X are transposed from
//               the standard bit order due to erratum RP2350-E6.
#define RVCSR_PMPCFG2_R10_R_RESET  _u(0x1)
#define RVCSR_PMPCFG2_R10_R_BITS   _u(0x00040000)
#define RVCSR_PMPCFG2_R10_R_MSB    _u(18)
#define RVCSR_PMPCFG2_R10_R_LSB    _u(18)
#define RVCSR_PMPCFG2_R10_R_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG2_R10_W
// Description : Write permission for region 10
#define RVCSR_PMPCFG2_R10_W_RESET  _u(0x1)
#define RVCSR_PMPCFG2_R10_W_BITS   _u(0x00020000)
#define RVCSR_PMPCFG2_R10_W_MSB    _u(17)
#define RVCSR_PMPCFG2_R10_W_LSB    _u(17)
#define RVCSR_PMPCFG2_R10_W_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG2_R10_X
// Description : Execute permission for region 10. Note R and X are transposed
//               from the standard bit order due to erratum RP2350-E6.
#define RVCSR_PMPCFG2_R10_X_RESET  _u(0x1)
#define RVCSR_PMPCFG2_R10_X_BITS   _u(0x00010000)
#define RVCSR_PMPCFG2_R10_X_MSB    _u(16)
#define RVCSR_PMPCFG2_R10_X_LSB    _u(16)
#define RVCSR_PMPCFG2_R10_X_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG2_R9_L
// Description : Lock region 9, and apply it to M-mode as well as U-mode.
#define RVCSR_PMPCFG2_R9_L_RESET  _u(0x0)
#define RVCSR_PMPCFG2_R9_L_BITS   _u(0x00008000)
#define RVCSR_PMPCFG2_R9_L_MSB    _u(15)
#define RVCSR_PMPCFG2_R9_L_LSB    _u(15)
#define RVCSR_PMPCFG2_R9_L_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG2_R9_A
// Description : Address matching type for region 9. Writing an unsupported
//               value (TOR) will set the region to OFF.
//               0x0 -> Disable region
//               0x2 -> Naturally aligned 4-byte
//               0x3 -> Naturally aligned power-of-two (8 bytes to 4 GiB)
#define RVCSR_PMPCFG2_R9_A_RESET  _u(0x3)
#define RVCSR_PMPCFG2_R9_A_BITS   _u(0x00001800)
#define RVCSR_PMPCFG2_R9_A_MSB    _u(12)
#define RVCSR_PMPCFG2_R9_A_LSB    _u(11)
#define RVCSR_PMPCFG2_R9_A_ACCESS "RO"
#define RVCSR_PMPCFG2_R9_A_VALUE_OFF _u(0x0)
#define RVCSR_PMPCFG2_R9_A_VALUE_NA4 _u(0x2)
#define RVCSR_PMPCFG2_R9_A_VALUE_NAPOT _u(0x3)
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG2_R9_R
// Description : Read permission for region 9. Note R and X are transposed from
//               the standard bit order due to erratum RP2350-E6.
#define RVCSR_PMPCFG2_R9_R_RESET  _u(0x1)
#define RVCSR_PMPCFG2_R9_R_BITS   _u(0x00000400)
#define RVCSR_PMPCFG2_R9_R_MSB    _u(10)
#define RVCSR_PMPCFG2_R9_R_LSB    _u(10)
#define RVCSR_PMPCFG2_R9_R_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG2_R9_W
// Description : Write permission for region 9
#define RVCSR_PMPCFG2_R9_W_RESET  _u(0x1)
#define RVCSR_PMPCFG2_R9_W_BITS   _u(0x00000200)
#define RVCSR_PMPCFG2_R9_W_MSB    _u(9)
#define RVCSR_PMPCFG2_R9_W_LSB    _u(9)
#define RVCSR_PMPCFG2_R9_W_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG2_R9_X
// Description : Execute permission for region 9. Note R and X are transposed
//               from the standard bit order due to erratum RP2350-E6.
#define RVCSR_PMPCFG2_R9_X_RESET  _u(0x1)
#define RVCSR_PMPCFG2_R9_X_BITS   _u(0x00000100)
#define RVCSR_PMPCFG2_R9_X_MSB    _u(8)
#define RVCSR_PMPCFG2_R9_X_LSB    _u(8)
#define RVCSR_PMPCFG2_R9_X_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG2_R8_L
// Description : Lock region 8, and apply it to M-mode as well as U-mode.
#define RVCSR_PMPCFG2_R8_L_RESET  _u(0x0)
#define RVCSR_PMPCFG2_R8_L_BITS   _u(0x00000080)
#define RVCSR_PMPCFG2_R8_L_MSB    _u(7)
#define RVCSR_PMPCFG2_R8_L_LSB    _u(7)
#define RVCSR_PMPCFG2_R8_L_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG2_R8_A
// Description : Address matching type for region 8. Writing an unsupported
//               value (TOR) will set the region to OFF.
//               0x0 -> Disable region
//               0x2 -> Naturally aligned 4-byte
//               0x3 -> Naturally aligned power-of-two (8 bytes to 4 GiB)
#define RVCSR_PMPCFG2_R8_A_RESET  _u(0x3)
#define RVCSR_PMPCFG2_R8_A_BITS   _u(0x00000018)
#define RVCSR_PMPCFG2_R8_A_MSB    _u(4)
#define RVCSR_PMPCFG2_R8_A_LSB    _u(3)
#define RVCSR_PMPCFG2_R8_A_ACCESS "RO"
#define RVCSR_PMPCFG2_R8_A_VALUE_OFF _u(0x0)
#define RVCSR_PMPCFG2_R8_A_VALUE_NA4 _u(0x2)
#define RVCSR_PMPCFG2_R8_A_VALUE_NAPOT _u(0x3)
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG2_R8_R
// Description : Read permission for region 8. Note R and X are transposed from
//               the standard bit order due to erratum RP2350-E6.
#define RVCSR_PMPCFG2_R8_R_RESET  _u(0x1)
#define RVCSR_PMPCFG2_R8_R_BITS   _u(0x00000004)
#define RVCSR_PMPCFG2_R8_R_MSB    _u(2)
#define RVCSR_PMPCFG2_R8_R_LSB    _u(2)
#define RVCSR_PMPCFG2_R8_R_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG2_R8_W
// Description : Write permission for region 8
#define RVCSR_PMPCFG2_R8_W_RESET  _u(0x1)
#define RVCSR_PMPCFG2_R8_W_BITS   _u(0x00000002)
#define RVCSR_PMPCFG2_R8_W_MSB    _u(1)
#define RVCSR_PMPCFG2_R8_W_LSB    _u(1)
#define RVCSR_PMPCFG2_R8_W_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG2_R8_X
// Description : Execute permission for region 8. Note R and X are transposed
//               from the standard bit order due to erratum RP2350-E6.
#define RVCSR_PMPCFG2_R8_X_RESET  _u(0x1)
#define RVCSR_PMPCFG2_R8_X_BITS   _u(0x00000001)
#define RVCSR_PMPCFG2_R8_X_MSB    _u(0)
#define RVCSR_PMPCFG2_R8_X_LSB    _u(0)
#define RVCSR_PMPCFG2_R8_X_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_PMPCFG3
// Description : Physical memory protection configuration for regions 12 through
