Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/rvcsr.h
//               15
#define RVCSR_PMPCFG3_OFFSET _u(0x000003a3)
#define RVCSR_PMPCFG3_BITS   _u(0x9f9f9f9f)
#define RVCSR_PMPCFG3_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG3_R15_L
// Description : Lock region 15, and apply it to M-mode as well as U-mode.
#define RVCSR_PMPCFG3_R15_L_RESET  _u(0x0)
#define RVCSR_PMPCFG3_R15_L_BITS   _u(0x80000000)
#define RVCSR_PMPCFG3_R15_L_MSB    _u(31)
#define RVCSR_PMPCFG3_R15_L_LSB    _u(31)
#define RVCSR_PMPCFG3_R15_L_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG3_R15_A
// Description : Address matching type for region 15. Writing an unsupported
//               value (TOR) will set the region to OFF.
//               0x0 -> Disable region
//               0x2 -> Naturally aligned 4-byte
//               0x3 -> Naturally aligned power-of-two (8 bytes to 4 GiB)
#define RVCSR_PMPCFG3_R15_A_RESET  _u(0x0)
#define RVCSR_PMPCFG3_R15_A_BITS   _u(0x18000000)
#define RVCSR_PMPCFG3_R15_A_MSB    _u(28)
#define RVCSR_PMPCFG3_R15_A_LSB    _u(27)
#define RVCSR_PMPCFG3_R15_A_ACCESS "RO"
#define RVCSR_PMPCFG3_R15_A_VALUE_OFF _u(0x0)
#define RVCSR_PMPCFG3_R15_A_VALUE_NA4 _u(0x2)
#define RVCSR_PMPCFG3_R15_A_VALUE_NAPOT _u(0x3)
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG3_R15_R
// Description : Read permission for region 15. Note R and X are transposed from
//               the standard bit order due to erratum RP2350-E6.
#define RVCSR_PMPCFG3_R15_R_RESET  _u(0x0)
#define RVCSR_PMPCFG3_R15_R_BITS   _u(0x04000000)
#define RVCSR_PMPCFG3_R15_R_MSB    _u(26)
#define RVCSR_PMPCFG3_R15_R_LSB    _u(26)
#define RVCSR_PMPCFG3_R15_R_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG3_R15_W
// Description : Write permission for region 15
#define RVCSR_PMPCFG3_R15_W_RESET  _u(0x0)
#define RVCSR_PMPCFG3_R15_W_BITS   _u(0x02000000)
#define RVCSR_PMPCFG3_R15_W_MSB    _u(25)
#define RVCSR_PMPCFG3_R15_W_LSB    _u(25)
#define RVCSR_PMPCFG3_R15_W_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG3_R15_X
// Description : Execute permission for region 15. Note R and X are transposed
//               from the standard bit order due to erratum RP2350-E6.
#define RVCSR_PMPCFG3_R15_X_RESET  _u(0x0)
#define RVCSR_PMPCFG3_R15_X_BITS   _u(0x01000000)
#define RVCSR_PMPCFG3_R15_X_MSB    _u(24)
#define RVCSR_PMPCFG3_R15_X_LSB    _u(24)
#define RVCSR_PMPCFG3_R15_X_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG3_R14_L
// Description : Lock region 14, and apply it to M-mode as well as U-mode.
#define RVCSR_PMPCFG3_R14_L_RESET  _u(0x0)
#define RVCSR_PMPCFG3_R14_L_BITS   _u(0x00800000)
#define RVCSR_PMPCFG3_R14_L_MSB    _u(23)
#define RVCSR_PMPCFG3_R14_L_LSB    _u(23)
#define RVCSR_PMPCFG3_R14_L_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG3_R14_A
// Description : Address matching type for region 14. Writing an unsupported
//               value (TOR) will set the region to OFF.
//               0x0 -> Disable region
//               0x2 -> Naturally aligned 4-byte
//               0x3 -> Naturally aligned power-of-two (8 bytes to 4 GiB)
#define RVCSR_PMPCFG3_R14_A_RESET  _u(0x0)
#define RVCSR_PMPCFG3_R14_A_BITS   _u(0x00180000)
#define RVCSR_PMPCFG3_R14_A_MSB    _u(20)
#define RVCSR_PMPCFG3_R14_A_LSB    _u(19)
#define RVCSR_PMPCFG3_R14_A_ACCESS "RO"
#define RVCSR_PMPCFG3_R14_A_VALUE_OFF _u(0x0)
#define RVCSR_PMPCFG3_R14_A_VALUE_NA4 _u(0x2)
#define RVCSR_PMPCFG3_R14_A_VALUE_NAPOT _u(0x3)
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG3_R14_R
// Description : Read permission for region 14. Note R and X are transposed from
//               the standard bit order due to erratum RP2350-E6.
#define RVCSR_PMPCFG3_R14_R_RESET  _u(0x0)
#define RVCSR_PMPCFG3_R14_R_BITS   _u(0x00040000)
#define RVCSR_PMPCFG3_R14_R_MSB    _u(18)
#define RVCSR_PMPCFG3_R14_R_LSB    _u(18)
#define RVCSR_PMPCFG3_R14_R_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG3_R14_W
// Description : Write permission for region 14
#define RVCSR_PMPCFG3_R14_W_RESET  _u(0x0)
#define RVCSR_PMPCFG3_R14_W_BITS   _u(0x00020000)
#define RVCSR_PMPCFG3_R14_W_MSB    _u(17)
#define RVCSR_PMPCFG3_R14_W_LSB    _u(17)
#define RVCSR_PMPCFG3_R14_W_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG3_R14_X
// Description : Execute permission for region 14. Note R and X are transposed
//               from the standard bit order due to erratum RP2350-E6.
#define RVCSR_PMPCFG3_R14_X_RESET  _u(0x0)
#define RVCSR_PMPCFG3_R14_X_BITS   _u(0x00010000)
#define RVCSR_PMPCFG3_R14_X_MSB    _u(16)
#define RVCSR_PMPCFG3_R14_X_LSB    _u(16)
#define RVCSR_PMPCFG3_R14_X_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG3_R13_L
// Description : Lock region 13, and apply it to M-mode as well as U-mode.
#define RVCSR_PMPCFG3_R13_L_RESET  _u(0x0)
#define RVCSR_PMPCFG3_R13_L_BITS   _u(0x00008000)
#define RVCSR_PMPCFG3_R13_L_MSB    _u(15)
#define RVCSR_PMPCFG3_R13_L_LSB    _u(15)
#define RVCSR_PMPCFG3_R13_L_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG3_R13_A
// Description : Address matching type for region 13. Writing an unsupported
//               value (TOR) will set the region to OFF.
//               0x0 -> Disable region
//               0x2 -> Naturally aligned 4-byte
//               0x3 -> Naturally aligned power-of-two (8 bytes to 4 GiB)
#define RVCSR_PMPCFG3_R13_A_RESET  _u(0x0)
#define RVCSR_PMPCFG3_R13_A_BITS   _u(0x00001800)
#define RVCSR_PMPCFG3_R13_A_MSB    _u(12)
#define RVCSR_PMPCFG3_R13_A_LSB    _u(11)
#define RVCSR_PMPCFG3_R13_A_ACCESS "RO"
#define RVCSR_PMPCFG3_R13_A_VALUE_OFF _u(0x0)
#define RVCSR_PMPCFG3_R13_A_VALUE_NA4 _u(0x2)
#define RVCSR_PMPCFG3_R13_A_VALUE_NAPOT _u(0x3)
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG3_R13_R
// Description : Read permission for region 13. Note R and X are transposed from
//               the standard bit order due to erratum RP2350-E6.
#define RVCSR_PMPCFG3_R13_R_RESET  _u(0x0)
#define RVCSR_PMPCFG3_R13_R_BITS   _u(0x00000400)
#define RVCSR_PMPCFG3_R13_R_MSB    _u(10)
#define RVCSR_PMPCFG3_R13_R_LSB    _u(10)
#define RVCSR_PMPCFG3_R13_R_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG3_R13_W
// Description : Write permission for region 13
#define RVCSR_PMPCFG3_R13_W_RESET  _u(0x0)
#define RVCSR_PMPCFG3_R13_W_BITS   _u(0x00000200)
#define RVCSR_PMPCFG3_R13_W_MSB    _u(9)
#define RVCSR_PMPCFG3_R13_W_LSB    _u(9)
#define RVCSR_PMPCFG3_R13_W_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG3_R13_X
// Description : Execute permission for region 13. Note R and X are transposed
//               from the standard bit order due to erratum RP2350-E6.
#define RVCSR_PMPCFG3_R13_X_RESET  _u(0x0)
#define RVCSR_PMPCFG3_R13_X_BITS   _u(0x00000100)
#define RVCSR_PMPCFG3_R13_X_MSB    _u(8)
#define RVCSR_PMPCFG3_R13_X_LSB    _u(8)
#define RVCSR_PMPCFG3_R13_X_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG3_R12_L
// Description : Lock region 12, and apply it to M-mode as well as U-mode.
#define RVCSR_PMPCFG3_R12_L_RESET  _u(0x0)
#define RVCSR_PMPCFG3_R12_L_BITS   _u(0x00000080)
#define RVCSR_PMPCFG3_R12_L_MSB    _u(7)
#define RVCSR_PMPCFG3_R12_L_LSB    _u(7)
#define RVCSR_PMPCFG3_R12_L_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG3_R12_A
// Description : Address matching type for region 12. Writing an unsupported
//               value (TOR) will set the region to OFF.
//               0x0 -> Disable region
//               0x2 -> Naturally aligned 4-byte
//               0x3 -> Naturally aligned power-of-two (8 bytes to 4 GiB)
#define RVCSR_PMPCFG3_R12_A_RESET  _u(0x0)
#define RVCSR_PMPCFG3_R12_A_BITS   _u(0x00000018)
#define RVCSR_PMPCFG3_R12_A_MSB    _u(4)
#define RVCSR_PMPCFG3_R12_A_LSB    _u(3)
#define RVCSR_PMPCFG3_R12_A_ACCESS "RO"
#define RVCSR_PMPCFG3_R12_A_VALUE_OFF _u(0x0)
#define RVCSR_PMPCFG3_R12_A_VALUE_NA4 _u(0x2)
#define RVCSR_PMPCFG3_R12_A_VALUE_NAPOT _u(0x3)
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG3_R12_R
// Description : Read permission for region 12. Note R and X are transposed from
//               the standard bit order due to erratum RP2350-E6.
#define RVCSR_PMPCFG3_R12_R_RESET  _u(0x0)
#define RVCSR_PMPCFG3_R12_R_BITS   _u(0x00000004)
#define RVCSR_PMPCFG3_R12_R_MSB    _u(2)
#define RVCSR_PMPCFG3_R12_R_LSB    _u(2)
#define RVCSR_PMPCFG3_R12_R_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG3_R12_W
// Description : Write permission for region 12
#define RVCSR_PMPCFG3_R12_W_RESET  _u(0x0)
#define RVCSR_PMPCFG3_R12_W_BITS   _u(0x00000002)
#define RVCSR_PMPCFG3_R12_W_MSB    _u(1)
#define RVCSR_PMPCFG3_R12_W_LSB    _u(1)
#define RVCSR_PMPCFG3_R12_W_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RVCSR_PMPCFG3_R12_X
// Description : Execute permission for region 12. Note R and X are transposed
//               from the standard bit order due to erratum RP2350-E6.
#define RVCSR_PMPCFG3_R12_X_RESET  _u(0x0)
#define RVCSR_PMPCFG3_R12_X_BITS   _u(0x00000001)
#define RVCSR_PMPCFG3_R12_X_MSB    _u(0)
#define RVCSR_PMPCFG3_R12_X_LSB    _u(0)
#define RVCSR_PMPCFG3_R12_X_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_PMPADDR0
// Description : Physical memory protection address for region 0. Note all PMP
//               addresses are in units of four bytes.
#define RVCSR_PMPADDR0_OFFSET _u(0x000003b0)
#define RVCSR_PMPADDR0_BITS   _u(0x3fffffff)
#define RVCSR_PMPADDR0_RESET  _u(0x00000000)
#define RVCSR_PMPADDR0_MSB    _u(29)
#define RVCSR_PMPADDR0_LSB    _u(0)
#define RVCSR_PMPADDR0_ACCESS "RW"
// =============================================================================
// Register    : RVCSR_PMPADDR1
// Description : Physical memory protection address for region 1. Note all PMP
//               addresses are in units of four bytes.
#define RVCSR_PMPADDR1_OFFSET _u(0x000003b1)
#define RVCSR_PMPADDR1_BITS   _u(0x3fffffff)
#define RVCSR_PMPADDR1_RESET  _u(0x00000000)
#define RVCSR_PMPADDR1_MSB    _u(29)
#define RVCSR_PMPADDR1_LSB    _u(0)
#define RVCSR_PMPADDR1_ACCESS "RW"
// =============================================================================
// Register    : RVCSR_PMPADDR2
// Description : Physical memory protection address for region 2. Note all PMP
//               addresses are in units of four bytes.
#define RVCSR_PMPADDR2_OFFSET _u(0x000003b2)
#define RVCSR_PMPADDR2_BITS   _u(0x3fffffff)
#define RVCSR_PMPADDR2_RESET  _u(0x00000000)
#define RVCSR_PMPADDR2_MSB    _u(29)
#define RVCSR_PMPADDR2_LSB    _u(0)
#define RVCSR_PMPADDR2_ACCESS "RW"
// =============================================================================
// Register    : RVCSR_PMPADDR3
// Description : Physical memory protection address for region 3. Note all PMP
//               addresses are in units of four bytes.
#define RVCSR_PMPADDR3_OFFSET _u(0x000003b3)
#define RVCSR_PMPADDR3_BITS   _u(0x3fffffff)
#define RVCSR_PMPADDR3_RESET  _u(0x00000000)
#define RVCSR_PMPADDR3_MSB    _u(29)
#define RVCSR_PMPADDR3_LSB    _u(0)
#define RVCSR_PMPADDR3_ACCESS "RW"
// =============================================================================
// Register    : RVCSR_PMPADDR4
// Description : Physical memory protection address for region 4. Note all PMP
//               addresses are in units of four bytes.
#define RVCSR_PMPADDR4_OFFSET _u(0x000003b4)
#define RVCSR_PMPADDR4_BITS   _u(0x3fffffff)
#define RVCSR_PMPADDR4_RESET  _u(0x00000000)
#define RVCSR_PMPADDR4_MSB    _u(29)
#define RVCSR_PMPADDR4_LSB    _u(0)
#define RVCSR_PMPADDR4_ACCESS "RW"
// =============================================================================
// Register    : RVCSR_PMPADDR5
// Description : Physical memory protection address for region 5. Note all PMP
//               addresses are in units of four bytes.
#define RVCSR_PMPADDR5_OFFSET _u(0x000003b5)
#define RVCSR_PMPADDR5_BITS   _u(0x3fffffff)
#define RVCSR_PMPADDR5_RESET  _u(0x00000000)
#define RVCSR_PMPADDR5_MSB    _u(29)
#define RVCSR_PMPADDR5_LSB    _u(0)
#define RVCSR_PMPADDR5_ACCESS "RW"
// =============================================================================
// Register    : RVCSR_PMPADDR6
// Description : Physical memory protection address for region 6. Note all PMP
//               addresses are in units of four bytes.
#define RVCSR_PMPADDR6_OFFSET _u(0x000003b6)
#define RVCSR_PMPADDR6_BITS   _u(0x3fffffff)
#define RVCSR_PMPADDR6_RESET  _u(0x00000000)
#define RVCSR_PMPADDR6_MSB    _u(29)
#define RVCSR_PMPADDR6_LSB    _u(0)
#define RVCSR_PMPADDR6_ACCESS "RW"
// =============================================================================
// Register    : RVCSR_PMPADDR7
// Description : Physical memory protection address for region 7. Note all PMP
//               addresses are in units of four bytes.
#define RVCSR_PMPADDR7_OFFSET _u(0x000003b7)
#define RVCSR_PMPADDR7_BITS   _u(0x3fffffff)
#define RVCSR_PMPADDR7_RESET  _u(0x00000000)
#define RVCSR_PMPADDR7_MSB    _u(29)
#define RVCSR_PMPADDR7_LSB    _u(0)
#define RVCSR_PMPADDR7_ACCESS "RW"
// =============================================================================
// Register    : RVCSR_PMPADDR8
// Description : Physical memory protection address for region 8. Note all PMP
//               addresses are in units of four bytes.
//
//               Hardwired to the address range `0x00000000` through
//               `0x0fffffff`, which contains the boot ROM. This range is made
//               accessible to User mode by default. User mode access to this
//               range can be disabled using one of the dynamically configurable
//               PMP regions, or using the permission registers in ACCESSCTRL.
#define RVCSR_PMPADDR8_OFFSET _u(0x000003b8)
#define RVCSR_PMPADDR8_BITS   _u(0x3fffffff)
#define RVCSR_PMPADDR8_RESET  _u(0x01ffffff)
#define RVCSR_PMPADDR8_MSB    _u(29)
#define RVCSR_PMPADDR8_LSB    _u(0)
#define RVCSR_PMPADDR8_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_PMPADDR9
// Description : Physical memory protection address for region 9. Note all PMP
//               addresses are in units of four bytes.
//
//               Hardwired to the address range `0x40000000` through
//               `0x5fffffff`, which contains the system peripherals. This range
//               is made accessible to User mode by default. User mode access to
//               this range can be disabled using one of the dynamically
//               configurable PMP regions, or using the permission registers in
//               ACCESSCTRL.
#define RVCSR_PMPADDR9_OFFSET _u(0x000003b9)
#define RVCSR_PMPADDR9_BITS   _u(0x3fffffff)
#define RVCSR_PMPADDR9_RESET  _u(0x13ffffff)
#define RVCSR_PMPADDR9_MSB    _u(29)
#define RVCSR_PMPADDR9_LSB    _u(0)
#define RVCSR_PMPADDR9_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_PMPADDR10
// Description : Physical memory protection address for region 10. Note all PMP
//               addresses are in units of four bytes.
//
//               Hardwired to the address range `0xd0000000` through
//               `0xdfffffff`, which contains the core-local peripherals (SIO).
//               This range is made accessible to User mode by default. User
//               mode access to this range can be disabled using one of the
//               dynamically configurable PMP regions, or using the permission
//               registers in ACCESSCTRL.
#define RVCSR_PMPADDR10_OFFSET _u(0x000003ba)
#define RVCSR_PMPADDR10_BITS   _u(0x3fffffff)
#define RVCSR_PMPADDR10_RESET  _u(0x35ffffff)
#define RVCSR_PMPADDR10_MSB    _u(29)
#define RVCSR_PMPADDR10_LSB    _u(0)
#define RVCSR_PMPADDR10_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_PMPADDR11
// Description : Physical memory protection address for region 11. Note all PMP
//               addresses are in units of four bytes.
//
//               Hardwired to all-zeroes. This region is not implemented.
#define RVCSR_PMPADDR11_OFFSET _u(0x000003bb)
#define RVCSR_PMPADDR11_BITS   _u(0x3fffffff)
#define RVCSR_PMPADDR11_RESET  _u(0x00000000)
#define RVCSR_PMPADDR11_MSB    _u(29)
#define RVCSR_PMPADDR11_LSB    _u(0)
#define RVCSR_PMPADDR11_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_PMPADDR12
// Description : Physical memory protection address for region 12. Note all PMP
//               addresses are in units of four bytes.
//
//               Hardwired to all-zeroes. This region is not implemented.
#define RVCSR_PMPADDR12_OFFSET _u(0x000003bc)
#define RVCSR_PMPADDR12_BITS   _u(0x3fffffff)
#define RVCSR_PMPADDR12_RESET  _u(0x00000000)
#define RVCSR_PMPADDR12_MSB    _u(29)
#define RVCSR_PMPADDR12_LSB    _u(0)
#define RVCSR_PMPADDR12_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_PMPADDR13
// Description : Physical memory protection address for region 13. Note all PMP
//               addresses are in units of four bytes.
//
//               Hardwired to all-zeroes. This region is not implemented.
#define RVCSR_PMPADDR13_OFFSET _u(0x000003bd)
#define RVCSR_PMPADDR13_BITS   _u(0x3fffffff)
#define RVCSR_PMPADDR13_RESET  _u(0x00000000)
#define RVCSR_PMPADDR13_MSB    _u(29)
#define RVCSR_PMPADDR13_LSB    _u(0)
#define RVCSR_PMPADDR13_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_PMPADDR14
// Description : Physical memory protection address for region 14. Note all PMP
//               addresses are in units of four bytes.
//
//               Hardwired to all-zeroes. This region is not implemented.
#define RVCSR_PMPADDR14_OFFSET _u(0x000003be)
#define RVCSR_PMPADDR14_BITS   _u(0x3fffffff)
#define RVCSR_PMPADDR14_RESET  _u(0x00000000)
#define RVCSR_PMPADDR14_MSB    _u(29)
#define RVCSR_PMPADDR14_LSB    _u(0)
#define RVCSR_PMPADDR14_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_PMPADDR15
// Description : Physical memory protection address for region 15. Note all PMP
//               addresses are in units of four bytes.
//
//               Hardwired to all-zeroes. This region is not implemented.
#define RVCSR_PMPADDR15_OFFSET _u(0x000003bf)
#define RVCSR_PMPADDR15_BITS   _u(0x3fffffff)
#define RVCSR_PMPADDR15_RESET  _u(0x00000000)
#define RVCSR_PMPADDR15_MSB    _u(29)
#define RVCSR_PMPADDR15_LSB    _u(0)
#define RVCSR_PMPADDR15_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_TSELECT
// Description : Select trigger to be configured via `tdata1`/`tdata2`
//
//               On RP2350, four instruction address triggers are implemented,
//               so only the two LSBs of this register are writable.
#define RVCSR_TSELECT_OFFSET _u(0x000007a0)
#define RVCSR_TSELECT_BITS   _u(0x00000003)
#define RVCSR_TSELECT_RESET  _u(0x00000000)
#define RVCSR_TSELECT_MSB    _u(1)
#define RVCSR_TSELECT_LSB    _u(0)
#define RVCSR_TSELECT_ACCESS "RW"
// =============================================================================
// Register    : RVCSR_TDATA1
// Description : Trigger configuration data 1
//
//               Hazard 3 only supports address/data match triggers (type=2) so
//               this register description includes the `mcontrol` fields for
//               this type.
//
//               More precisely, Hazard3 only supports exact instruction address
//               match triggers (hardware breakpoints) so many of this
//               register's fields are hardwired.
#define RVCSR_TDATA1_OFFSET _u(0x000007a1)
#define RVCSR_TDATA1_BITS   _u(0xffffffcf)
#define RVCSR_TDATA1_RESET  _u(0x20000000)
// -----------------------------------------------------------------------------
// Field       : RVCSR_TDATA1_TYPE
// Description : Trigger type. Hardwired to type=2, meaning an address/data
//               match trigger
#define RVCSR_TDATA1_TYPE_RESET  _u(0x2)
#define RVCSR_TDATA1_TYPE_BITS   _u(0xf0000000)
#define RVCSR_TDATA1_TYPE_MSB    _u(31)
#define RVCSR_TDATA1_TYPE_LSB    _u(28)
#define RVCSR_TDATA1_TYPE_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RVCSR_TDATA1_DMODE
// Description : If 0, both Debug and M-mode can write the `tdata` registers at
//               the selected `tselect`.
//
//               If 1, only Debug Mode can write the `tdata` registers at the
//               selected `tselect`. Writes from other modes are ignored.
//
//               This bit is only writable from Debug Mode
#define RVCSR_TDATA1_DMODE_RESET  _u(0x0)
#define RVCSR_TDATA1_DMODE_BITS   _u(0x08000000)
#define RVCSR_TDATA1_DMODE_MSB    _u(27)
#define RVCSR_TDATA1_DMODE_LSB    _u(27)
#define RVCSR_TDATA1_DMODE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RVCSR_TDATA1_MASKMAX
// Description : Value of 0 indicates only exact address matches are supported
#define RVCSR_TDATA1_MASKMAX_RESET  _u(0x00)
#define RVCSR_TDATA1_MASKMAX_BITS   _u(0x07e00000)
#define RVCSR_TDATA1_MASKMAX_MSB    _u(26)
#define RVCSR_TDATA1_MASKMAX_LSB    _u(21)
#define RVCSR_TDATA1_MASKMAX_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RVCSR_TDATA1_HIT
// Description : Trigger hit flag. Not implemented, hardwired to 0.
#define RVCSR_TDATA1_HIT_RESET  _u(0x0)
#define RVCSR_TDATA1_HIT_BITS   _u(0x00100000)
#define RVCSR_TDATA1_HIT_MSB    _u(20)
#define RVCSR_TDATA1_HIT_LSB    _u(20)
#define RVCSR_TDATA1_HIT_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RVCSR_TDATA1_SELECT
// Description : Hardwired value of 0 indicates that only address matches are
//               supported, not data matches
#define RVCSR_TDATA1_SELECT_RESET  _u(0x0)
#define RVCSR_TDATA1_SELECT_BITS   _u(0x00080000)
#define RVCSR_TDATA1_SELECT_MSB    _u(19)
#define RVCSR_TDATA1_SELECT_LSB    _u(19)
#define RVCSR_TDATA1_SELECT_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RVCSR_TDATA1_TIMING
// Description : Hardwired value of 0 indicates that trigger fires before the
//               triggering instruction executes, not afterward
#define RVCSR_TDATA1_TIMING_RESET  _u(0x0)
#define RVCSR_TDATA1_TIMING_BITS   _u(0x00040000)
#define RVCSR_TDATA1_TIMING_MSB    _u(18)
#define RVCSR_TDATA1_TIMING_LSB    _u(18)
#define RVCSR_TDATA1_TIMING_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RVCSR_TDATA1_SIZELO
