Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/rvcsr.h
// Description : Hardwired value of 0 indicates that access size matching is not
//               supported
#define RVCSR_TDATA1_SIZELO_RESET  _u(0x0)
#define RVCSR_TDATA1_SIZELO_BITS   _u(0x00030000)
#define RVCSR_TDATA1_SIZELO_MSB    _u(17)
#define RVCSR_TDATA1_SIZELO_LSB    _u(16)
#define RVCSR_TDATA1_SIZELO_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RVCSR_TDATA1_ACTION
// Description : Select action to be taken when the trigger fires.
//               0x0 -> Raise a breakpoint exception, which can be handled by the M-mode exception handler
//               0x1 -> Enter debug mode. This action is only selectable when `tdata1.dmode` is 1.
#define RVCSR_TDATA1_ACTION_RESET  _u(0x0)
#define RVCSR_TDATA1_ACTION_BITS   _u(0x0000f000)
#define RVCSR_TDATA1_ACTION_MSB    _u(15)
#define RVCSR_TDATA1_ACTION_LSB    _u(12)
#define RVCSR_TDATA1_ACTION_ACCESS "RW"
#define RVCSR_TDATA1_ACTION_VALUE_EBREAK _u(0x0)
#define RVCSR_TDATA1_ACTION_VALUE_DEBUG _u(0x1)
// -----------------------------------------------------------------------------
// Field       : RVCSR_TDATA1_CHAIN
// Description : Hardwired to 0 to indicate trigger chaining is not supported.
#define RVCSR_TDATA1_CHAIN_RESET  _u(0x0)
#define RVCSR_TDATA1_CHAIN_BITS   _u(0x00000800)
#define RVCSR_TDATA1_CHAIN_MSB    _u(11)
#define RVCSR_TDATA1_CHAIN_LSB    _u(11)
#define RVCSR_TDATA1_CHAIN_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RVCSR_TDATA1_MATCH
// Description : Hardwired to 0 to indicate match is always on the full address
//               specified by `tdata2`
#define RVCSR_TDATA1_MATCH_RESET  _u(0x0)
#define RVCSR_TDATA1_MATCH_BITS   _u(0x00000780)
#define RVCSR_TDATA1_MATCH_MSB    _u(10)
#define RVCSR_TDATA1_MATCH_LSB    _u(7)
#define RVCSR_TDATA1_MATCH_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RVCSR_TDATA1_M
// Description : When set, enable this trigger in M-mode
#define RVCSR_TDATA1_M_RESET  _u(0x0)
#define RVCSR_TDATA1_M_BITS   _u(0x00000040)
#define RVCSR_TDATA1_M_MSB    _u(6)
#define RVCSR_TDATA1_M_LSB    _u(6)
#define RVCSR_TDATA1_M_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RVCSR_TDATA1_U
// Description : When set, enable this trigger in U-mode
#define RVCSR_TDATA1_U_RESET  _u(0x0)
#define RVCSR_TDATA1_U_BITS   _u(0x00000008)
#define RVCSR_TDATA1_U_MSB    _u(3)
#define RVCSR_TDATA1_U_LSB    _u(3)
#define RVCSR_TDATA1_U_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RVCSR_TDATA1_EXECUTE
// Description : When set, the trigger fires on the address of an instruction
//               that is executed.
#define RVCSR_TDATA1_EXECUTE_RESET  _u(0x0)
#define RVCSR_TDATA1_EXECUTE_BITS   _u(0x00000004)
#define RVCSR_TDATA1_EXECUTE_MSB    _u(2)
#define RVCSR_TDATA1_EXECUTE_LSB    _u(2)
#define RVCSR_TDATA1_EXECUTE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RVCSR_TDATA1_STORE
// Description : Hardwired to 0 to indicate store address/data triggers are not
//               supported
#define RVCSR_TDATA1_STORE_RESET  _u(0x0)
#define RVCSR_TDATA1_STORE_BITS   _u(0x00000002)
#define RVCSR_TDATA1_STORE_MSB    _u(1)
#define RVCSR_TDATA1_STORE_LSB    _u(1)
#define RVCSR_TDATA1_STORE_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RVCSR_TDATA1_LOAD
// Description : Hardwired to 0 to indicate load address/data triggers are not
//               supported
#define RVCSR_TDATA1_LOAD_RESET  _u(0x0)
#define RVCSR_TDATA1_LOAD_BITS   _u(0x00000001)
#define RVCSR_TDATA1_LOAD_MSB    _u(0)
#define RVCSR_TDATA1_LOAD_LSB    _u(0)
#define RVCSR_TDATA1_LOAD_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_TDATA2
// Description : Trigger configuration data 2
//
//               Contains the address for instruction address triggers (hardware
//               breakpoints)
#define RVCSR_TDATA2_OFFSET _u(0x000007a2)
#define RVCSR_TDATA2_BITS   _u(0xffffffff)
#define RVCSR_TDATA2_RESET  _u(0x00000000)
#define RVCSR_TDATA2_MSB    _u(31)
#define RVCSR_TDATA2_LSB    _u(0)
#define RVCSR_TDATA2_ACCESS "RW"
// =============================================================================
// Register    : RVCSR_DCSR
// Description : Debug control and status register. Access outside of Debug Mode
//               will cause an illegal instruction exception.
#define RVCSR_DCSR_OFFSET _u(0x000007b0)
#define RVCSR_DCSR_BITS   _u(0xf0009fc7)
#define RVCSR_DCSR_RESET  _u(0x40000603)
// -----------------------------------------------------------------------------
// Field       : RVCSR_DCSR_XDEBUGVER
// Description : Hardwired to 4: external debug support as per RISC-V 0.13.2
//               debug specification.
#define RVCSR_DCSR_XDEBUGVER_RESET  _u(0x4)
#define RVCSR_DCSR_XDEBUGVER_BITS   _u(0xf0000000)
#define RVCSR_DCSR_XDEBUGVER_MSB    _u(31)
#define RVCSR_DCSR_XDEBUGVER_LSB    _u(28)
#define RVCSR_DCSR_XDEBUGVER_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RVCSR_DCSR_EBREAKM
// Description : When 1, `ebreak` instructions executed in M-mode will break to
//               Debug Mode instead of trapping
#define RVCSR_DCSR_EBREAKM_RESET  _u(0x0)
#define RVCSR_DCSR_EBREAKM_BITS   _u(0x00008000)
#define RVCSR_DCSR_EBREAKM_MSB    _u(15)
#define RVCSR_DCSR_EBREAKM_LSB    _u(15)
#define RVCSR_DCSR_EBREAKM_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RVCSR_DCSR_EBREAKU
// Description : When 1, `ebreak` instructions executed in U-mode will break to
//               Debug Mode instead of trapping.
#define RVCSR_DCSR_EBREAKU_RESET  _u(0x0)
#define RVCSR_DCSR_EBREAKU_BITS   _u(0x00001000)
#define RVCSR_DCSR_EBREAKU_MSB    _u(12)
#define RVCSR_DCSR_EBREAKU_LSB    _u(12)
#define RVCSR_DCSR_EBREAKU_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RVCSR_DCSR_STEPIE
// Description : Hardwired to 0: no interrupts are taken during hardware single-
//               stepping.
#define RVCSR_DCSR_STEPIE_RESET  _u(0x0)
#define RVCSR_DCSR_STEPIE_BITS   _u(0x00000800)
#define RVCSR_DCSR_STEPIE_MSB    _u(11)
#define RVCSR_DCSR_STEPIE_LSB    _u(11)
#define RVCSR_DCSR_STEPIE_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RVCSR_DCSR_STOPCOUNT
// Description : Hardwired to 1: `mcycle`/`mcycleh` and `minstret`/`minstreth`
//               do not increment in Debug Mode.
#define RVCSR_DCSR_STOPCOUNT_RESET  _u(0x1)
#define RVCSR_DCSR_STOPCOUNT_BITS   _u(0x00000400)
#define RVCSR_DCSR_STOPCOUNT_MSB    _u(10)
#define RVCSR_DCSR_STOPCOUNT_LSB    _u(10)
#define RVCSR_DCSR_STOPCOUNT_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RVCSR_DCSR_STOPTIME
// Description : Hardwired to 1: core-local timers don't increment in debug
//               mode. External timers (e.g. hart-shared) may be configured to
//               ignore this.
#define RVCSR_DCSR_STOPTIME_RESET  _u(0x1)
#define RVCSR_DCSR_STOPTIME_BITS   _u(0x00000200)
#define RVCSR_DCSR_STOPTIME_MSB    _u(9)
#define RVCSR_DCSR_STOPTIME_LSB    _u(9)
#define RVCSR_DCSR_STOPTIME_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RVCSR_DCSR_CAUSE
// Description : Set by hardware when entering debug mode.
//               0x1 -> An ebreak instruction was executed when the relevant `dcsr.ebreakx` bit was set.
//               0x2 -> The trigger module caused a breakpoint exception.
//               0x3 -> Processor entered Debug Mode due to a halt request, or a reset-halt request present when the core reset was released.
//               0x4 -> Processor entered Debug Mode after executing one instruction with single-stepping enabled.
#define RVCSR_DCSR_CAUSE_RESET  _u(0x0)
#define RVCSR_DCSR_CAUSE_BITS   _u(0x000001c0)
#define RVCSR_DCSR_CAUSE_MSB    _u(8)
#define RVCSR_DCSR_CAUSE_LSB    _u(6)
#define RVCSR_DCSR_CAUSE_ACCESS "RO"
#define RVCSR_DCSR_CAUSE_VALUE_EBREAK _u(0x1)
#define RVCSR_DCSR_CAUSE_VALUE_TRIGGER _u(0x2)
#define RVCSR_DCSR_CAUSE_VALUE_HALTREQ _u(0x3)
#define RVCSR_DCSR_CAUSE_VALUE_STEP _u(0x4)
// -----------------------------------------------------------------------------
// Field       : RVCSR_DCSR_STEP
// Description : When 1, re-enter Debug Mode after each instruction executed in
//               M-mode or U-mode.
#define RVCSR_DCSR_STEP_RESET  _u(0x0)
#define RVCSR_DCSR_STEP_BITS   _u(0x00000004)
#define RVCSR_DCSR_STEP_MSB    _u(2)
#define RVCSR_DCSR_STEP_LSB    _u(2)
#define RVCSR_DCSR_STEP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RVCSR_DCSR_PRV
// Description : Read the privilege mode the core was in when entering Debug
//               Mode, and set the privilege mode the core will execute in when
//               returning from Debug Mode.
#define RVCSR_DCSR_PRV_RESET  _u(0x3)
#define RVCSR_DCSR_PRV_BITS   _u(0x00000003)
#define RVCSR_DCSR_PRV_MSB    _u(1)
#define RVCSR_DCSR_PRV_LSB    _u(0)
#define RVCSR_DCSR_PRV_ACCESS "RW"
// =============================================================================
// Register    : RVCSR_DPC
// Description : Debug program counter. When entering Debug Mode, `dpc` samples
//               the current program counter, e.g. the address of an `ebreak`
//               which caused Debug Mode entry. When leaving debug mode, the
//               processor jumps to `dpc`. The host may read/write this register
//               whilst in Debug Mode.
#define RVCSR_DPC_OFFSET _u(0x000007b1)
#define RVCSR_DPC_BITS   _u(0xfffffffe)
#define RVCSR_DPC_RESET  _u(0x00000000)
#define RVCSR_DPC_MSB    _u(31)
#define RVCSR_DPC_LSB    _u(1)
#define RVCSR_DPC_ACCESS "RW"
// =============================================================================
// Register    : RVCSR_MCYCLE
// Description : Machine-mode cycle counter, low half
//               Counts up once per cycle, when `mcountinhibit.cy` is 0.
//               Disabled by default to save power.
#define RVCSR_MCYCLE_OFFSET _u(0x00000b00)
#define RVCSR_MCYCLE_BITS   _u(0xffffffff)
#define RVCSR_MCYCLE_RESET  _u(0x00000000)
#define RVCSR_MCYCLE_MSB    _u(31)
#define RVCSR_MCYCLE_LSB    _u(0)
#define RVCSR_MCYCLE_ACCESS "RW"
// =============================================================================
// Register    : RVCSR_MINSTRET
// Description : Machine-mode instruction retire counter, low half
//               Counts up once per instruction, when `mcountinhibit.ir` is 0.
//               Disabled by default to save power.
#define RVCSR_MINSTRET_OFFSET _u(0x00000b02)
#define RVCSR_MINSTRET_BITS   _u(0xffffffff)
#define RVCSR_MINSTRET_RESET  _u(0x00000000)
#define RVCSR_MINSTRET_MSB    _u(31)
#define RVCSR_MINSTRET_LSB    _u(0)
#define RVCSR_MINSTRET_ACCESS "RW"
// =============================================================================
// Register    : RVCSR_MHPMCOUNTER3
// Description : Extended performance counter, hardwired to 0.
#define RVCSR_MHPMCOUNTER3_OFFSET _u(0x00000b03)
#define RVCSR_MHPMCOUNTER3_BITS   _u(0xffffffff)
#define RVCSR_MHPMCOUNTER3_RESET  _u(0x00000000)
#define RVCSR_MHPMCOUNTER3_MSB    _u(31)
#define RVCSR_MHPMCOUNTER3_LSB    _u(0)
#define RVCSR_MHPMCOUNTER3_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMCOUNTER4
// Description : Extended performance counter, hardwired to 0.
#define RVCSR_MHPMCOUNTER4_OFFSET _u(0x00000b04)
#define RVCSR_MHPMCOUNTER4_BITS   _u(0xffffffff)
#define RVCSR_MHPMCOUNTER4_RESET  _u(0x00000000)
#define RVCSR_MHPMCOUNTER4_MSB    _u(31)
#define RVCSR_MHPMCOUNTER4_LSB    _u(0)
#define RVCSR_MHPMCOUNTER4_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMCOUNTER5
// Description : Extended performance counter, hardwired to 0.
#define RVCSR_MHPMCOUNTER5_OFFSET _u(0x00000b05)
#define RVCSR_MHPMCOUNTER5_BITS   _u(0xffffffff)
#define RVCSR_MHPMCOUNTER5_RESET  _u(0x00000000)
#define RVCSR_MHPMCOUNTER5_MSB    _u(31)
#define RVCSR_MHPMCOUNTER5_LSB    _u(0)
#define RVCSR_MHPMCOUNTER5_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMCOUNTER6
// Description : Extended performance counter, hardwired to 0.
#define RVCSR_MHPMCOUNTER6_OFFSET _u(0x00000b06)
#define RVCSR_MHPMCOUNTER6_BITS   _u(0xffffffff)
#define RVCSR_MHPMCOUNTER6_RESET  _u(0x00000000)
#define RVCSR_MHPMCOUNTER6_MSB    _u(31)
#define RVCSR_MHPMCOUNTER6_LSB    _u(0)
#define RVCSR_MHPMCOUNTER6_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMCOUNTER7
// Description : Extended performance counter, hardwired to 0.
#define RVCSR_MHPMCOUNTER7_OFFSET _u(0x00000b07)
#define RVCSR_MHPMCOUNTER7_BITS   _u(0xffffffff)
#define RVCSR_MHPMCOUNTER7_RESET  _u(0x00000000)
#define RVCSR_MHPMCOUNTER7_MSB    _u(31)
#define RVCSR_MHPMCOUNTER7_LSB    _u(0)
#define RVCSR_MHPMCOUNTER7_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMCOUNTER8
// Description : Extended performance counter, hardwired to 0.
#define RVCSR_MHPMCOUNTER8_OFFSET _u(0x00000b08)
#define RVCSR_MHPMCOUNTER8_BITS   _u(0xffffffff)
#define RVCSR_MHPMCOUNTER8_RESET  _u(0x00000000)
#define RVCSR_MHPMCOUNTER8_MSB    _u(31)
#define RVCSR_MHPMCOUNTER8_LSB    _u(0)
#define RVCSR_MHPMCOUNTER8_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMCOUNTER9
// Description : Extended performance counter, hardwired to 0.
#define RVCSR_MHPMCOUNTER9_OFFSET _u(0x00000b09)
#define RVCSR_MHPMCOUNTER9_BITS   _u(0xffffffff)
#define RVCSR_MHPMCOUNTER9_RESET  _u(0x00000000)
#define RVCSR_MHPMCOUNTER9_MSB    _u(31)
#define RVCSR_MHPMCOUNTER9_LSB    _u(0)
#define RVCSR_MHPMCOUNTER9_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMCOUNTER10
// Description : Extended performance counter, hardwired to 0.
#define RVCSR_MHPMCOUNTER10_OFFSET _u(0x00000b0a)
#define RVCSR_MHPMCOUNTER10_BITS   _u(0xffffffff)
#define RVCSR_MHPMCOUNTER10_RESET  _u(0x00000000)
#define RVCSR_MHPMCOUNTER10_MSB    _u(31)
#define RVCSR_MHPMCOUNTER10_LSB    _u(0)
#define RVCSR_MHPMCOUNTER10_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMCOUNTER11
// Description : Extended performance counter, hardwired to 0.
#define RVCSR_MHPMCOUNTER11_OFFSET _u(0x00000b0b)
#define RVCSR_MHPMCOUNTER11_BITS   _u(0xffffffff)
#define RVCSR_MHPMCOUNTER11_RESET  _u(0x00000000)
#define RVCSR_MHPMCOUNTER11_MSB    _u(31)
#define RVCSR_MHPMCOUNTER11_LSB    _u(0)
#define RVCSR_MHPMCOUNTER11_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMCOUNTER12
// Description : Extended performance counter, hardwired to 0.
#define RVCSR_MHPMCOUNTER12_OFFSET _u(0x00000b0c)
#define RVCSR_MHPMCOUNTER12_BITS   _u(0xffffffff)
#define RVCSR_MHPMCOUNTER12_RESET  _u(0x00000000)
#define RVCSR_MHPMCOUNTER12_MSB    _u(31)
#define RVCSR_MHPMCOUNTER12_LSB    _u(0)
#define RVCSR_MHPMCOUNTER12_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMCOUNTER13
// Description : Extended performance counter, hardwired to 0.
#define RVCSR_MHPMCOUNTER13_OFFSET _u(0x00000b0d)
#define RVCSR_MHPMCOUNTER13_BITS   _u(0xffffffff)
#define RVCSR_MHPMCOUNTER13_RESET  _u(0x00000000)
#define RVCSR_MHPMCOUNTER13_MSB    _u(31)
#define RVCSR_MHPMCOUNTER13_LSB    _u(0)
#define RVCSR_MHPMCOUNTER13_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMCOUNTER14
// Description : Extended performance counter, hardwired to 0.
#define RVCSR_MHPMCOUNTER14_OFFSET _u(0x00000b0e)
#define RVCSR_MHPMCOUNTER14_BITS   _u(0xffffffff)
#define RVCSR_MHPMCOUNTER14_RESET  _u(0x00000000)
#define RVCSR_MHPMCOUNTER14_MSB    _u(31)
#define RVCSR_MHPMCOUNTER14_LSB    _u(0)
#define RVCSR_MHPMCOUNTER14_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMCOUNTER15
// Description : Extended performance counter, hardwired to 0.
#define RVCSR_MHPMCOUNTER15_OFFSET _u(0x00000b0f)
#define RVCSR_MHPMCOUNTER15_BITS   _u(0xffffffff)
#define RVCSR_MHPMCOUNTER15_RESET  _u(0x00000000)
#define RVCSR_MHPMCOUNTER15_MSB    _u(31)
#define RVCSR_MHPMCOUNTER15_LSB    _u(0)
#define RVCSR_MHPMCOUNTER15_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMCOUNTER16
// Description : Extended performance counter, hardwired to 0.
#define RVCSR_MHPMCOUNTER16_OFFSET _u(0x00000b10)
#define RVCSR_MHPMCOUNTER16_BITS   _u(0xffffffff)
#define RVCSR_MHPMCOUNTER16_RESET  _u(0x00000000)
#define RVCSR_MHPMCOUNTER16_MSB    _u(31)
#define RVCSR_MHPMCOUNTER16_LSB    _u(0)
#define RVCSR_MHPMCOUNTER16_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMCOUNTER17
// Description : Extended performance counter, hardwired to 0.
#define RVCSR_MHPMCOUNTER17_OFFSET _u(0x00000b11)
#define RVCSR_MHPMCOUNTER17_BITS   _u(0xffffffff)
#define RVCSR_MHPMCOUNTER17_RESET  _u(0x00000000)
#define RVCSR_MHPMCOUNTER17_MSB    _u(31)
#define RVCSR_MHPMCOUNTER17_LSB    _u(0)
#define RVCSR_MHPMCOUNTER17_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMCOUNTER18
// Description : Extended performance counter, hardwired to 0.
#define RVCSR_MHPMCOUNTER18_OFFSET _u(0x00000b12)
#define RVCSR_MHPMCOUNTER18_BITS   _u(0xffffffff)
#define RVCSR_MHPMCOUNTER18_RESET  _u(0x00000000)
#define RVCSR_MHPMCOUNTER18_MSB    _u(31)
#define RVCSR_MHPMCOUNTER18_LSB    _u(0)
#define RVCSR_MHPMCOUNTER18_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMCOUNTER19
// Description : Extended performance counter, hardwired to 0.
#define RVCSR_MHPMCOUNTER19_OFFSET _u(0x00000b13)
#define RVCSR_MHPMCOUNTER19_BITS   _u(0xffffffff)
#define RVCSR_MHPMCOUNTER19_RESET  _u(0x00000000)
#define RVCSR_MHPMCOUNTER19_MSB    _u(31)
#define RVCSR_MHPMCOUNTER19_LSB    _u(0)
#define RVCSR_MHPMCOUNTER19_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMCOUNTER20
// Description : Extended performance counter, hardwired to 0.
#define RVCSR_MHPMCOUNTER20_OFFSET _u(0x00000b14)
#define RVCSR_MHPMCOUNTER20_BITS   _u(0xffffffff)
#define RVCSR_MHPMCOUNTER20_RESET  _u(0x00000000)
#define RVCSR_MHPMCOUNTER20_MSB    _u(31)
#define RVCSR_MHPMCOUNTER20_LSB    _u(0)
#define RVCSR_MHPMCOUNTER20_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMCOUNTER21
// Description : Extended performance counter, hardwired to 0.
#define RVCSR_MHPMCOUNTER21_OFFSET _u(0x00000b15)
#define RVCSR_MHPMCOUNTER21_BITS   _u(0xffffffff)
#define RVCSR_MHPMCOUNTER21_RESET  _u(0x00000000)
#define RVCSR_MHPMCOUNTER21_MSB    _u(31)
#define RVCSR_MHPMCOUNTER21_LSB    _u(0)
#define RVCSR_MHPMCOUNTER21_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMCOUNTER22
// Description : Extended performance counter, hardwired to 0.
#define RVCSR_MHPMCOUNTER22_OFFSET _u(0x00000b16)
#define RVCSR_MHPMCOUNTER22_BITS   _u(0xffffffff)
#define RVCSR_MHPMCOUNTER22_RESET  _u(0x00000000)
#define RVCSR_MHPMCOUNTER22_MSB    _u(31)
#define RVCSR_MHPMCOUNTER22_LSB    _u(0)
#define RVCSR_MHPMCOUNTER22_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMCOUNTER23
// Description : Extended performance counter, hardwired to 0.
#define RVCSR_MHPMCOUNTER23_OFFSET _u(0x00000b17)
#define RVCSR_MHPMCOUNTER23_BITS   _u(0xffffffff)
#define RVCSR_MHPMCOUNTER23_RESET  _u(0x00000000)
#define RVCSR_MHPMCOUNTER23_MSB    _u(31)
#define RVCSR_MHPMCOUNTER23_LSB    _u(0)
#define RVCSR_MHPMCOUNTER23_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMCOUNTER24
// Description : Extended performance counter, hardwired to 0.
#define RVCSR_MHPMCOUNTER24_OFFSET _u(0x00000b18)
#define RVCSR_MHPMCOUNTER24_BITS   _u(0xffffffff)
#define RVCSR_MHPMCOUNTER24_RESET  _u(0x00000000)
#define RVCSR_MHPMCOUNTER24_MSB    _u(31)
#define RVCSR_MHPMCOUNTER24_LSB    _u(0)
#define RVCSR_MHPMCOUNTER24_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMCOUNTER25
// Description : Extended performance counter, hardwired to 0.
#define RVCSR_MHPMCOUNTER25_OFFSET _u(0x00000b19)
#define RVCSR_MHPMCOUNTER25_BITS   _u(0xffffffff)
#define RVCSR_MHPMCOUNTER25_RESET  _u(0x00000000)
#define RVCSR_MHPMCOUNTER25_MSB    _u(31)
#define RVCSR_MHPMCOUNTER25_LSB    _u(0)
#define RVCSR_MHPMCOUNTER25_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMCOUNTER26
// Description : Extended performance counter, hardwired to 0.
#define RVCSR_MHPMCOUNTER26_OFFSET _u(0x00000b1a)
#define RVCSR_MHPMCOUNTER26_BITS   _u(0xffffffff)
#define RVCSR_MHPMCOUNTER26_RESET  _u(0x00000000)
#define RVCSR_MHPMCOUNTER26_MSB    _u(31)
#define RVCSR_MHPMCOUNTER26_LSB    _u(0)
#define RVCSR_MHPMCOUNTER26_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMCOUNTER27
// Description : Extended performance counter, hardwired to 0.
#define RVCSR_MHPMCOUNTER27_OFFSET _u(0x00000b1b)
#define RVCSR_MHPMCOUNTER27_BITS   _u(0xffffffff)
#define RVCSR_MHPMCOUNTER27_RESET  _u(0x00000000)
#define RVCSR_MHPMCOUNTER27_MSB    _u(31)
#define RVCSR_MHPMCOUNTER27_LSB    _u(0)
#define RVCSR_MHPMCOUNTER27_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMCOUNTER28
// Description : Extended performance counter, hardwired to 0.
#define RVCSR_MHPMCOUNTER28_OFFSET _u(0x00000b1c)
#define RVCSR_MHPMCOUNTER28_BITS   _u(0xffffffff)
#define RVCSR_MHPMCOUNTER28_RESET  _u(0x00000000)
#define RVCSR_MHPMCOUNTER28_MSB    _u(31)
#define RVCSR_MHPMCOUNTER28_LSB    _u(0)
#define RVCSR_MHPMCOUNTER28_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMCOUNTER29
// Description : Extended performance counter, hardwired to 0.
#define RVCSR_MHPMCOUNTER29_OFFSET _u(0x00000b1d)
#define RVCSR_MHPMCOUNTER29_BITS   _u(0xffffffff)
#define RVCSR_MHPMCOUNTER29_RESET  _u(0x00000000)
#define RVCSR_MHPMCOUNTER29_MSB    _u(31)
#define RVCSR_MHPMCOUNTER29_LSB    _u(0)
#define RVCSR_MHPMCOUNTER29_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMCOUNTER30
// Description : Extended performance counter, hardwired to 0.
#define RVCSR_MHPMCOUNTER30_OFFSET _u(0x00000b1e)
#define RVCSR_MHPMCOUNTER30_BITS   _u(0xffffffff)
#define RVCSR_MHPMCOUNTER30_RESET  _u(0x00000000)
#define RVCSR_MHPMCOUNTER30_MSB    _u(31)
#define RVCSR_MHPMCOUNTER30_LSB    _u(0)
#define RVCSR_MHPMCOUNTER30_ACCESS "RO"
