Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/rvcsr.h
// =============================================================================
// Register    : RVCSR_MHPMCOUNTER31
// Description : Extended performance counter, hardwired to 0.
#define RVCSR_MHPMCOUNTER31_OFFSET _u(0x00000b1f)
#define RVCSR_MHPMCOUNTER31_BITS   _u(0xffffffff)
#define RVCSR_MHPMCOUNTER31_RESET  _u(0x00000000)
#define RVCSR_MHPMCOUNTER31_MSB    _u(31)
#define RVCSR_MHPMCOUNTER31_LSB    _u(0)
#define RVCSR_MHPMCOUNTER31_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MCYCLEH
// Description : Machine-mode cycle counter, high half
//               Counts up once per 1 << 32 cycles, when `mcountinhibit.cy` is
//               0. Disabled by default to save power.
#define RVCSR_MCYCLEH_OFFSET _u(0x00000b80)
#define RVCSR_MCYCLEH_BITS   _u(0xffffffff)
#define RVCSR_MCYCLEH_RESET  _u(0x00000000)
#define RVCSR_MCYCLEH_MSB    _u(31)
#define RVCSR_MCYCLEH_LSB    _u(0)
#define RVCSR_MCYCLEH_ACCESS "RW"
// =============================================================================
// Register    : RVCSR_MINSTRETH
// Description : Machine-mode instruction retire counter, low half
//               Counts up once per 1 << 32 instructions, when
//               `mcountinhibit.ir` is 0. Disabled by default to save power.
#define RVCSR_MINSTRETH_OFFSET _u(0x00000b82)
#define RVCSR_MINSTRETH_BITS   _u(0xffffffff)
#define RVCSR_MINSTRETH_RESET  _u(0x00000000)
#define RVCSR_MINSTRETH_MSB    _u(31)
#define RVCSR_MINSTRETH_LSB    _u(0)
#define RVCSR_MINSTRETH_ACCESS "RW"
// =============================================================================
// Register    : RVCSR_MHPMCOUNTER3H
// Description : Extended performance counter, hardwired to 0.
#define RVCSR_MHPMCOUNTER3H_OFFSET _u(0x00000b83)
#define RVCSR_MHPMCOUNTER3H_BITS   _u(0xffffffff)
#define RVCSR_MHPMCOUNTER3H_RESET  _u(0x00000000)
#define RVCSR_MHPMCOUNTER3H_MSB    _u(31)
#define RVCSR_MHPMCOUNTER3H_LSB    _u(0)
#define RVCSR_MHPMCOUNTER3H_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMCOUNTER4H
// Description : Extended performance counter, hardwired to 0.
#define RVCSR_MHPMCOUNTER4H_OFFSET _u(0x00000b84)
#define RVCSR_MHPMCOUNTER4H_BITS   _u(0xffffffff)
#define RVCSR_MHPMCOUNTER4H_RESET  _u(0x00000000)
#define RVCSR_MHPMCOUNTER4H_MSB    _u(31)
#define RVCSR_MHPMCOUNTER4H_LSB    _u(0)
#define RVCSR_MHPMCOUNTER4H_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMCOUNTER5H
// Description : Extended performance counter, hardwired to 0.
#define RVCSR_MHPMCOUNTER5H_OFFSET _u(0x00000b85)
#define RVCSR_MHPMCOUNTER5H_BITS   _u(0xffffffff)
#define RVCSR_MHPMCOUNTER5H_RESET  _u(0x00000000)
#define RVCSR_MHPMCOUNTER5H_MSB    _u(31)
#define RVCSR_MHPMCOUNTER5H_LSB    _u(0)
#define RVCSR_MHPMCOUNTER5H_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMCOUNTER6H
// Description : Extended performance counter, hardwired to 0.
#define RVCSR_MHPMCOUNTER6H_OFFSET _u(0x00000b86)
#define RVCSR_MHPMCOUNTER6H_BITS   _u(0xffffffff)
#define RVCSR_MHPMCOUNTER6H_RESET  _u(0x00000000)
#define RVCSR_MHPMCOUNTER6H_MSB    _u(31)
#define RVCSR_MHPMCOUNTER6H_LSB    _u(0)
#define RVCSR_MHPMCOUNTER6H_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMCOUNTER7H
// Description : Extended performance counter, hardwired to 0.
#define RVCSR_MHPMCOUNTER7H_OFFSET _u(0x00000b87)
#define RVCSR_MHPMCOUNTER7H_BITS   _u(0xffffffff)
#define RVCSR_MHPMCOUNTER7H_RESET  _u(0x00000000)
#define RVCSR_MHPMCOUNTER7H_MSB    _u(31)
#define RVCSR_MHPMCOUNTER7H_LSB    _u(0)
#define RVCSR_MHPMCOUNTER7H_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMCOUNTER8H
// Description : Extended performance counter, hardwired to 0.
#define RVCSR_MHPMCOUNTER8H_OFFSET _u(0x00000b88)
#define RVCSR_MHPMCOUNTER8H_BITS   _u(0xffffffff)
#define RVCSR_MHPMCOUNTER8H_RESET  _u(0x00000000)
#define RVCSR_MHPMCOUNTER8H_MSB    _u(31)
#define RVCSR_MHPMCOUNTER8H_LSB    _u(0)
#define RVCSR_MHPMCOUNTER8H_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMCOUNTER9H
// Description : Extended performance counter, hardwired to 0.
#define RVCSR_MHPMCOUNTER9H_OFFSET _u(0x00000b89)
#define RVCSR_MHPMCOUNTER9H_BITS   _u(0xffffffff)
#define RVCSR_MHPMCOUNTER9H_RESET  _u(0x00000000)
#define RVCSR_MHPMCOUNTER9H_MSB    _u(31)
#define RVCSR_MHPMCOUNTER9H_LSB    _u(0)
#define RVCSR_MHPMCOUNTER9H_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMCOUNTER10H
// Description : Extended performance counter, hardwired to 0.
#define RVCSR_MHPMCOUNTER10H_OFFSET _u(0x00000b8a)
#define RVCSR_MHPMCOUNTER10H_BITS   _u(0xffffffff)
#define RVCSR_MHPMCOUNTER10H_RESET  _u(0x00000000)
#define RVCSR_MHPMCOUNTER10H_MSB    _u(31)
#define RVCSR_MHPMCOUNTER10H_LSB    _u(0)
#define RVCSR_MHPMCOUNTER10H_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMCOUNTER11H
// Description : Extended performance counter, hardwired to 0.
#define RVCSR_MHPMCOUNTER11H_OFFSET _u(0x00000b8b)
#define RVCSR_MHPMCOUNTER11H_BITS   _u(0xffffffff)
#define RVCSR_MHPMCOUNTER11H_RESET  _u(0x00000000)
#define RVCSR_MHPMCOUNTER11H_MSB    _u(31)
#define RVCSR_MHPMCOUNTER11H_LSB    _u(0)
#define RVCSR_MHPMCOUNTER11H_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMCOUNTER12H
// Description : Extended performance counter, hardwired to 0.
#define RVCSR_MHPMCOUNTER12H_OFFSET _u(0x00000b8c)
#define RVCSR_MHPMCOUNTER12H_BITS   _u(0xffffffff)
#define RVCSR_MHPMCOUNTER12H_RESET  _u(0x00000000)
#define RVCSR_MHPMCOUNTER12H_MSB    _u(31)
#define RVCSR_MHPMCOUNTER12H_LSB    _u(0)
#define RVCSR_MHPMCOUNTER12H_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMCOUNTER13H
// Description : Extended performance counter, hardwired to 0.
#define RVCSR_MHPMCOUNTER13H_OFFSET _u(0x00000b8d)
#define RVCSR_MHPMCOUNTER13H_BITS   _u(0xffffffff)
#define RVCSR_MHPMCOUNTER13H_RESET  _u(0x00000000)
#define RVCSR_MHPMCOUNTER13H_MSB    _u(31)
#define RVCSR_MHPMCOUNTER13H_LSB    _u(0)
#define RVCSR_MHPMCOUNTER13H_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMCOUNTER14H
// Description : Extended performance counter, hardwired to 0.
#define RVCSR_MHPMCOUNTER14H_OFFSET _u(0x00000b8e)
#define RVCSR_MHPMCOUNTER14H_BITS   _u(0xffffffff)
#define RVCSR_MHPMCOUNTER14H_RESET  _u(0x00000000)
#define RVCSR_MHPMCOUNTER14H_MSB    _u(31)
#define RVCSR_MHPMCOUNTER14H_LSB    _u(0)
#define RVCSR_MHPMCOUNTER14H_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMCOUNTER15H
// Description : Extended performance counter, hardwired to 0.
#define RVCSR_MHPMCOUNTER15H_OFFSET _u(0x00000b8f)
#define RVCSR_MHPMCOUNTER15H_BITS   _u(0xffffffff)
#define RVCSR_MHPMCOUNTER15H_RESET  _u(0x00000000)
#define RVCSR_MHPMCOUNTER15H_MSB    _u(31)
#define RVCSR_MHPMCOUNTER15H_LSB    _u(0)
#define RVCSR_MHPMCOUNTER15H_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMCOUNTER16H
// Description : Extended performance counter, hardwired to 0.
#define RVCSR_MHPMCOUNTER16H_OFFSET _u(0x00000b90)
#define RVCSR_MHPMCOUNTER16H_BITS   _u(0xffffffff)
#define RVCSR_MHPMCOUNTER16H_RESET  _u(0x00000000)
#define RVCSR_MHPMCOUNTER16H_MSB    _u(31)
#define RVCSR_MHPMCOUNTER16H_LSB    _u(0)
#define RVCSR_MHPMCOUNTER16H_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMCOUNTER17H
// Description : Extended performance counter, hardwired to 0.
#define RVCSR_MHPMCOUNTER17H_OFFSET _u(0x00000b91)
#define RVCSR_MHPMCOUNTER17H_BITS   _u(0xffffffff)
#define RVCSR_MHPMCOUNTER17H_RESET  _u(0x00000000)
#define RVCSR_MHPMCOUNTER17H_MSB    _u(31)
#define RVCSR_MHPMCOUNTER17H_LSB    _u(0)
#define RVCSR_MHPMCOUNTER17H_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMCOUNTER18H
// Description : Extended performance counter, hardwired to 0.
#define RVCSR_MHPMCOUNTER18H_OFFSET _u(0x00000b92)
#define RVCSR_MHPMCOUNTER18H_BITS   _u(0xffffffff)
#define RVCSR_MHPMCOUNTER18H_RESET  _u(0x00000000)
#define RVCSR_MHPMCOUNTER18H_MSB    _u(31)
#define RVCSR_MHPMCOUNTER18H_LSB    _u(0)
#define RVCSR_MHPMCOUNTER18H_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMCOUNTER19H
// Description : Extended performance counter, hardwired to 0.
#define RVCSR_MHPMCOUNTER19H_OFFSET _u(0x00000b93)
#define RVCSR_MHPMCOUNTER19H_BITS   _u(0xffffffff)
#define RVCSR_MHPMCOUNTER19H_RESET  _u(0x00000000)
#define RVCSR_MHPMCOUNTER19H_MSB    _u(31)
#define RVCSR_MHPMCOUNTER19H_LSB    _u(0)
#define RVCSR_MHPMCOUNTER19H_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMCOUNTER20H
// Description : Extended performance counter, hardwired to 0.
#define RVCSR_MHPMCOUNTER20H_OFFSET _u(0x00000b94)
#define RVCSR_MHPMCOUNTER20H_BITS   _u(0xffffffff)
#define RVCSR_MHPMCOUNTER20H_RESET  _u(0x00000000)
#define RVCSR_MHPMCOUNTER20H_MSB    _u(31)
#define RVCSR_MHPMCOUNTER20H_LSB    _u(0)
#define RVCSR_MHPMCOUNTER20H_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMCOUNTER21H
// Description : Extended performance counter, hardwired to 0.
#define RVCSR_MHPMCOUNTER21H_OFFSET _u(0x00000b95)
#define RVCSR_MHPMCOUNTER21H_BITS   _u(0xffffffff)
#define RVCSR_MHPMCOUNTER21H_RESET  _u(0x00000000)
#define RVCSR_MHPMCOUNTER21H_MSB    _u(31)
#define RVCSR_MHPMCOUNTER21H_LSB    _u(0)
#define RVCSR_MHPMCOUNTER21H_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMCOUNTER22H
// Description : Extended performance counter, hardwired to 0.
#define RVCSR_MHPMCOUNTER22H_OFFSET _u(0x00000b96)
#define RVCSR_MHPMCOUNTER22H_BITS   _u(0xffffffff)
#define RVCSR_MHPMCOUNTER22H_RESET  _u(0x00000000)
#define RVCSR_MHPMCOUNTER22H_MSB    _u(31)
#define RVCSR_MHPMCOUNTER22H_LSB    _u(0)
#define RVCSR_MHPMCOUNTER22H_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMCOUNTER23H
// Description : Extended performance counter, hardwired to 0.
#define RVCSR_MHPMCOUNTER23H_OFFSET _u(0x00000b97)
#define RVCSR_MHPMCOUNTER23H_BITS   _u(0xffffffff)
#define RVCSR_MHPMCOUNTER23H_RESET  _u(0x00000000)
#define RVCSR_MHPMCOUNTER23H_MSB    _u(31)
#define RVCSR_MHPMCOUNTER23H_LSB    _u(0)
#define RVCSR_MHPMCOUNTER23H_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMCOUNTER24H
// Description : Extended performance counter, hardwired to 0.
#define RVCSR_MHPMCOUNTER24H_OFFSET _u(0x00000b98)
#define RVCSR_MHPMCOUNTER24H_BITS   _u(0xffffffff)
#define RVCSR_MHPMCOUNTER24H_RESET  _u(0x00000000)
#define RVCSR_MHPMCOUNTER24H_MSB    _u(31)
#define RVCSR_MHPMCOUNTER24H_LSB    _u(0)
#define RVCSR_MHPMCOUNTER24H_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMCOUNTER25H
// Description : Extended performance counter, hardwired to 0.
#define RVCSR_MHPMCOUNTER25H_OFFSET _u(0x00000b99)
#define RVCSR_MHPMCOUNTER25H_BITS   _u(0xffffffff)
#define RVCSR_MHPMCOUNTER25H_RESET  _u(0x00000000)
#define RVCSR_MHPMCOUNTER25H_MSB    _u(31)
#define RVCSR_MHPMCOUNTER25H_LSB    _u(0)
#define RVCSR_MHPMCOUNTER25H_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMCOUNTER26H
// Description : Extended performance counter, hardwired to 0.
#define RVCSR_MHPMCOUNTER26H_OFFSET _u(0x00000b9a)
#define RVCSR_MHPMCOUNTER26H_BITS   _u(0xffffffff)
#define RVCSR_MHPMCOUNTER26H_RESET  _u(0x00000000)
#define RVCSR_MHPMCOUNTER26H_MSB    _u(31)
#define RVCSR_MHPMCOUNTER26H_LSB    _u(0)
#define RVCSR_MHPMCOUNTER26H_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMCOUNTER27H
// Description : Extended performance counter, hardwired to 0.
#define RVCSR_MHPMCOUNTER27H_OFFSET _u(0x00000b9b)
#define RVCSR_MHPMCOUNTER27H_BITS   _u(0xffffffff)
#define RVCSR_MHPMCOUNTER27H_RESET  _u(0x00000000)
#define RVCSR_MHPMCOUNTER27H_MSB    _u(31)
#define RVCSR_MHPMCOUNTER27H_LSB    _u(0)
#define RVCSR_MHPMCOUNTER27H_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMCOUNTER28H
// Description : Extended performance counter, hardwired to 0.
#define RVCSR_MHPMCOUNTER28H_OFFSET _u(0x00000b9c)
#define RVCSR_MHPMCOUNTER28H_BITS   _u(0xffffffff)
#define RVCSR_MHPMCOUNTER28H_RESET  _u(0x00000000)
#define RVCSR_MHPMCOUNTER28H_MSB    _u(31)
#define RVCSR_MHPMCOUNTER28H_LSB    _u(0)
#define RVCSR_MHPMCOUNTER28H_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMCOUNTER29H
// Description : Extended performance counter, hardwired to 0.
#define RVCSR_MHPMCOUNTER29H_OFFSET _u(0x00000b9d)
#define RVCSR_MHPMCOUNTER29H_BITS   _u(0xffffffff)
#define RVCSR_MHPMCOUNTER29H_RESET  _u(0x00000000)
#define RVCSR_MHPMCOUNTER29H_MSB    _u(31)
#define RVCSR_MHPMCOUNTER29H_LSB    _u(0)
#define RVCSR_MHPMCOUNTER29H_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMCOUNTER30H
// Description : Extended performance counter, hardwired to 0.
#define RVCSR_MHPMCOUNTER30H_OFFSET _u(0x00000b9e)
#define RVCSR_MHPMCOUNTER30H_BITS   _u(0xffffffff)
#define RVCSR_MHPMCOUNTER30H_RESET  _u(0x00000000)
#define RVCSR_MHPMCOUNTER30H_MSB    _u(31)
#define RVCSR_MHPMCOUNTER30H_LSB    _u(0)
#define RVCSR_MHPMCOUNTER30H_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHPMCOUNTER31H
// Description : Extended performance counter, hardwired to 0.
#define RVCSR_MHPMCOUNTER31H_OFFSET _u(0x00000b9f)
#define RVCSR_MHPMCOUNTER31H_BITS   _u(0xffffffff)
#define RVCSR_MHPMCOUNTER31H_RESET  _u(0x00000000)
#define RVCSR_MHPMCOUNTER31H_MSB    _u(31)
#define RVCSR_MHPMCOUNTER31H_LSB    _u(0)
#define RVCSR_MHPMCOUNTER31H_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_PMPCFGM0
// Description : PMP M-mode configuration. One bit per PMP region. Setting a bit
//               makes the corresponding region apply to M-mode (like the
//               `pmpcfg.L` bit) but does not lock the region.
//
//               PMP is useful for non-security-related purposes, such as stack
//               guarding and peripheral emulation. This extension allows M-mode
//               to freely use any currently unlocked regions for its own
//               purposes, without the inconvenience of having to lock them.
//
//               Note that this does not grant any new capabilities to M-mode,
//               since in the base standard it is already possible to apply
//               unlocked regions to M-mode by locking them. In general, PMP
//               regions should be locked in ascending region number order so
//               they can't be subsequently overridden by currently unlocked
//               regions.
//
//               Note also that this is not the same as the rule locking bypass
//               bit in the ePMP extension, which does not permit locked and
//               unlocked M-mode regions to coexist.
//
//               This is a Hazard3 custom CSR.
#define RVCSR_PMPCFGM0_OFFSET _u(0x00000bd0)
#define RVCSR_PMPCFGM0_BITS   _u(0x0000ffff)
#define RVCSR_PMPCFGM0_RESET  _u(0x00000000)
#define RVCSR_PMPCFGM0_MSB    _u(15)
#define RVCSR_PMPCFGM0_LSB    _u(0)
#define RVCSR_PMPCFGM0_ACCESS "RW"
// =============================================================================
// Register    : RVCSR_MEIEA
// Description : External interrupt enable array.
//
//               The array contains a read-write bit for each external interrupt
//               request: a `1` bit indicates that interrupt is currently
//               enabled. At reset, all external interrupts are disabled.
//
//               If enabled, an external interrupt can cause assertion of the
//               standard RISC-V machine external interrupt pending flag
//               (`mip.meip`), and therefore cause the processor to enter the
//               external interrupt vector. See `meipa`.
//
//               There are up to 512 external interrupts. The upper half of this
//               register contains a 16-bit window into the full 512-bit vector.
//               The window is indexed by the 5 LSBs of the write data.
#define RVCSR_MEIEA_OFFSET _u(0x00000be0)
#define RVCSR_MEIEA_BITS   _u(0xffff001f)
#define RVCSR_MEIEA_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : RVCSR_MEIEA_WINDOW
// Description : 16-bit read/write window into the external interrupt enable
//               array
#define RVCSR_MEIEA_WINDOW_RESET  _u(0x0000)
#define RVCSR_MEIEA_WINDOW_BITS   _u(0xffff0000)
#define RVCSR_MEIEA_WINDOW_MSB    _u(31)
#define RVCSR_MEIEA_WINDOW_LSB    _u(16)
#define RVCSR_MEIEA_WINDOW_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RVCSR_MEIEA_INDEX
// Description : Write-only self-clearing field (no value is stored) used to
//               control which window of the array appears in `window`.
#define RVCSR_MEIEA_INDEX_RESET  _u(0x00)
#define RVCSR_MEIEA_INDEX_BITS   _u(0x0000001f)
#define RVCSR_MEIEA_INDEX_MSB    _u(4)
#define RVCSR_MEIEA_INDEX_LSB    _u(0)
#define RVCSR_MEIEA_INDEX_ACCESS "WO"
// =============================================================================
// Register    : RVCSR_MEIPA
// Description : External interrupt pending array
//
//               Contains a read-only bit for each external interrupt request.
//               Similarly to `meiea`, this register is a window into an array
//               of up to 512 external interrupt flags. The status appears in
//               the upper 16 bits of the value read from `meipa`, and the lower
//               5 bits of the value _written_ by the same CSR instruction (or 0
//               if no write takes place) select a 16-bit window of the full
//               interrupt pending array.
//
//               A `1` bit indicates that interrupt is currently asserted. IRQs
//               are assumed to be level-sensitive, and the relevant `meipa` bit
//               is cleared by servicing the requestor so that it deasserts its
//               interrupt request.
//
//               When any interrupt of sufficient priority is both set in
//               `meipa` and enabled in `meiea`, the standard RISC-V external
//               interrupt pending bit `mip.meip` is asserted. In other words,
//               `meipa` is filtered by `meiea` to generate the standard
//               `mip.meip` flag.
#define RVCSR_MEIPA_OFFSET _u(0x00000be1)
#define RVCSR_MEIPA_BITS   _u(0xffff001f)
#define RVCSR_MEIPA_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : RVCSR_MEIPA_WINDOW
// Description : 16-bit read-only window into the external interrupt pending
//               array
#define RVCSR_MEIPA_WINDOW_RESET  "-"
#define RVCSR_MEIPA_WINDOW_BITS   _u(0xffff0000)
#define RVCSR_MEIPA_WINDOW_MSB    _u(31)
#define RVCSR_MEIPA_WINDOW_LSB    _u(16)
#define RVCSR_MEIPA_WINDOW_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RVCSR_MEIPA_INDEX
// Description : Write-only, self-clearing field (no value is stored) used to
//               control which window of the array appears in `window`.
#define RVCSR_MEIPA_INDEX_RESET  _u(0x00)
#define RVCSR_MEIPA_INDEX_BITS   _u(0x0000001f)
#define RVCSR_MEIPA_INDEX_MSB    _u(4)
#define RVCSR_MEIPA_INDEX_LSB    _u(0)
#define RVCSR_MEIPA_INDEX_ACCESS "WO"
// =============================================================================
// Register    : RVCSR_MEIFA
// Description : External interrupt force array
//
//               Contains a read-write bit for every interrupt request. Writing
//               a 1 to a bit in the interrupt force array causes the
//               corresponding bit to become pending in `meipa`. Software can
//               use this feature to manually trigger a particular interrupt.
//
//               There are no restrictions on using `meifa` inside of an
//               interrupt. The more useful case here is to schedule some lower-
//               priority handler from within a high-priority interrupt, so that
//               it will execute before the core returns to the foreground code.
//               Implementers may wish to reserve some external IRQs with their
//               external inputs tied to 0 for this purpose.
//
//               Bits can be cleared by software, and are cleared automatically
//               by hardware upon a read of `meinext` which returns the
//               corresponding IRQ number in `meinext.irq` with `mienext.noirq`
//               clear (no matter whether `meinext.update` is written).
//
//               `meifa` implements the same array window indexing scheme as
//               `meiea` and `meipa`.
#define RVCSR_MEIFA_OFFSET _u(0x00000be2)
#define RVCSR_MEIFA_BITS   _u(0xffff001f)
#define RVCSR_MEIFA_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : RVCSR_MEIFA_WINDOW
// Description : 16-bit read/write window into the external interrupt force
//               array
#define RVCSR_MEIFA_WINDOW_RESET  _u(0x0000)
#define RVCSR_MEIFA_WINDOW_BITS   _u(0xffff0000)
#define RVCSR_MEIFA_WINDOW_MSB    _u(31)
#define RVCSR_MEIFA_WINDOW_LSB    _u(16)
#define RVCSR_MEIFA_WINDOW_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RVCSR_MEIFA_INDEX
// Description : Write-only, self-clearing field (no value is stored) used to
//               control which window of the array appears in `window`.
#define RVCSR_MEIFA_INDEX_RESET  _u(0x00)
#define RVCSR_MEIFA_INDEX_BITS   _u(0x0000001f)
#define RVCSR_MEIFA_INDEX_MSB    _u(4)
#define RVCSR_MEIFA_INDEX_LSB    _u(0)
#define RVCSR_MEIFA_INDEX_ACCESS "WO"
// =============================================================================
// Register    : RVCSR_MEIPRA
// Description : External interrupt priority array
//
//               Each interrupt has an (up to) 4-bit priority value associated
//               with it, and each access to this register reads and/or writes a
//               16-bit window containing four such priority values. When less
//               than 16 priority levels are available, the LSBs of the priority
//               fields are hardwired to 0.
//
//               When an interrupt's priority is lower than the current
//               preemption priority `meicontext.preempt`, it is treated as not
//               being pending for the purposes of `mip.meip`. The pending bit
//               in `meipa` will still assert, but the machine external
