Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/rvcsr.h
//               interrupt pending bit `mip.meip` will not, so the processor
//               will ignore this interrupt. See `meicontext`.
#define RVCSR_MEIPRA_OFFSET _u(0x00000be3)
#define RVCSR_MEIPRA_BITS   _u(0xffff001f)
#define RVCSR_MEIPRA_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : RVCSR_MEIPRA_WINDOW
// Description : 16-bit read/write window into the external interrupt priority
//               array, containing four 4-bit priority values.
#define RVCSR_MEIPRA_WINDOW_RESET  _u(0x0000)
#define RVCSR_MEIPRA_WINDOW_BITS   _u(0xffff0000)
#define RVCSR_MEIPRA_WINDOW_MSB    _u(31)
#define RVCSR_MEIPRA_WINDOW_LSB    _u(16)
#define RVCSR_MEIPRA_WINDOW_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RVCSR_MEIPRA_INDEX
// Description : Write-only, self-clearing field (no value is stored) used to
//               control which window of the array appears in `window`.
#define RVCSR_MEIPRA_INDEX_RESET  _u(0x00)
#define RVCSR_MEIPRA_INDEX_BITS   _u(0x0000001f)
#define RVCSR_MEIPRA_INDEX_MSB    _u(4)
#define RVCSR_MEIPRA_INDEX_LSB    _u(0)
#define RVCSR_MEIPRA_INDEX_ACCESS "WO"
// =============================================================================
// Register    : RVCSR_MEINEXT
// Description : Get next external interrupt
//
//               Contains the index of the highest-priority external interrupt
//               which is both asserted in `meipa` and enabled in `meiea`, left-
//               shifted by 2 so that it can be used to index an array of 32-bit
//               function pointers. If there is no such interrupt, the MSB is
//               set.
//
//               When multiple interrupts of the same priority are both pending
//               and enabled, the lowest-numbered wins. Interrupts with priority
//               less than `meicontext.ppreempt` -- the _previous_ preemption
//               priority -- are treated as though they are not pending. This is
//               to ensure that a preempting interrupt frame does not service
//               interrupts which may be in progress in the frame that was
//               preempted.
#define RVCSR_MEINEXT_OFFSET _u(0x00000be4)
#define RVCSR_MEINEXT_BITS   _u(0x800007fd)
#define RVCSR_MEINEXT_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : RVCSR_MEINEXT_NOIRQ
// Description : Set when there is no external interrupt which is enabled,
//               pending, and has priority greater than or equal to
//               `meicontext.ppreempt`. Can be efficiently tested with a `bltz`
//               or `bgez` instruction.
#define RVCSR_MEINEXT_NOIRQ_RESET  _u(0x0)
#define RVCSR_MEINEXT_NOIRQ_BITS   _u(0x80000000)
#define RVCSR_MEINEXT_NOIRQ_MSB    _u(31)
#define RVCSR_MEINEXT_NOIRQ_LSB    _u(31)
#define RVCSR_MEINEXT_NOIRQ_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RVCSR_MEINEXT_IRQ
// Description : Index of the highest-priority active external interrupt. Zero
//               when no external interrupts with sufficient priority are both
//               pending and enabled.
#define RVCSR_MEINEXT_IRQ_RESET  _u(0x000)
#define RVCSR_MEINEXT_IRQ_BITS   _u(0x000007fc)
#define RVCSR_MEINEXT_IRQ_MSB    _u(10)
#define RVCSR_MEINEXT_IRQ_LSB    _u(2)
#define RVCSR_MEINEXT_IRQ_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RVCSR_MEINEXT_UPDATE
// Description : Writing 1 (self-clearing) causes hardware to update
//               `meicontext` according to the IRQ number and preemption
//               priority of the interrupt indicated in `noirq`/`irq`. This
//               should be done in a single atomic operation, i.e. `csrrsi a0,
//               meinext, 0x1`.
#define RVCSR_MEINEXT_UPDATE_RESET  _u(0x0)
#define RVCSR_MEINEXT_UPDATE_BITS   _u(0x00000001)
#define RVCSR_MEINEXT_UPDATE_MSB    _u(0)
#define RVCSR_MEINEXT_UPDATE_LSB    _u(0)
#define RVCSR_MEINEXT_UPDATE_ACCESS "SC"
// =============================================================================
// Register    : RVCSR_MEICONTEXT
// Description : External interrupt context register
//
//               Configures the priority level for interrupt preemption, and
//               helps software track which interrupt it is currently in. The
//               latter is useful when a common interrupt service routine
//               handles interrupt requests from multiple instances of the same
//               peripheral.
//
//               A three-level stack of preemption priorities is maintained in
//               the `preempt`, `ppreempt` and `pppreempt` fields. The priority
//               stack is saved when hardware enters the external interrupt
//               vector, and restored by an `mret` instruction if
//               `meicontext.mreteirq` is set.
//
//               The top entry of the priority stack, `preempt`, is used by
//               hardware to ensure that only higher-priority interrupts can
//               preempt the current interrupt. The next entry, `ppreempt`, is
//               used to avoid servicing interrupts which may already be in
//               progress in a frame that was preempted. The third entry,
//               `pppreempt`, has no hardware effect, but ensures that `preempt`
//               and `ppreempt` can be correctly saved/restored across arbitrary
//               levels of preemption.
#define RVCSR_MEICONTEXT_OFFSET _u(0x00000be5)
#define RVCSR_MEICONTEXT_BITS   _u(0xff1f9fff)
#define RVCSR_MEICONTEXT_RESET  _u(0x00008000)
// -----------------------------------------------------------------------------
// Field       : RVCSR_MEICONTEXT_PPPREEMPT
// Description : Previous `ppreempt`. Set to `ppreempt` on priority save, set to
//               zero on priority restore.  Has no hardware effect, but ensures
//               that when `meicontext` is saved/restored correctly, `preempt`
//               and `ppreempt` stack correctly through arbitrarily many
//               preemption frames.
#define RVCSR_MEICONTEXT_PPPREEMPT_RESET  _u(0x0)
#define RVCSR_MEICONTEXT_PPPREEMPT_BITS   _u(0xf0000000)
#define RVCSR_MEICONTEXT_PPPREEMPT_MSB    _u(31)
#define RVCSR_MEICONTEXT_PPPREEMPT_LSB    _u(28)
#define RVCSR_MEICONTEXT_PPPREEMPT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RVCSR_MEICONTEXT_PPREEMPT
// Description : Previous `preempt`. Set to `preempt` on priority save, restored
//               to to `pppreempt` on priority restore.
//
//               IRQs of lower priority than `ppreempt` are not visible in
//               `meinext`, so that a preemptee is not re-taken in the
//               preempting frame.
#define RVCSR_MEICONTEXT_PPREEMPT_RESET  _u(0x0)
#define RVCSR_MEICONTEXT_PPREEMPT_BITS   _u(0x0f000000)
#define RVCSR_MEICONTEXT_PPREEMPT_MSB    _u(27)
#define RVCSR_MEICONTEXT_PPREEMPT_LSB    _u(24)
#define RVCSR_MEICONTEXT_PPREEMPT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RVCSR_MEICONTEXT_PREEMPT
// Description : Minimum interrupt priority to preempt the current interrupt.
//               Interrupts with lower priority than `preempt` do not cause the
//               core to transfer to an interrupt handler. Updated by hardware
//               when when `meinext.update` is written, or when hardware enters
//               the external interrupt vector.
//
//               If an interrupt is present in `meinext` when this field is
//               updated, then `preempt` is set to one level greater than that
//               interrupt's priority. Otherwise, `ppreempt` is set to one level
//               greater than the maximum interrupt priority, disabling
//               preemption.
#define RVCSR_MEICONTEXT_PREEMPT_RESET  _u(0x00)
#define RVCSR_MEICONTEXT_PREEMPT_BITS   _u(0x001f0000)
#define RVCSR_MEICONTEXT_PREEMPT_MSB    _u(20)
#define RVCSR_MEICONTEXT_PREEMPT_LSB    _u(16)
#define RVCSR_MEICONTEXT_PREEMPT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RVCSR_MEICONTEXT_NOIRQ
// Description : Not in interrupt (read/write). Set to 1 at reset. Set to
//               `meinext.noirq` when `meinext.update` is written. No hardware
//               effect.
#define RVCSR_MEICONTEXT_NOIRQ_RESET  _u(0x1)
#define RVCSR_MEICONTEXT_NOIRQ_BITS   _u(0x00008000)
#define RVCSR_MEICONTEXT_NOIRQ_MSB    _u(15)
#define RVCSR_MEICONTEXT_NOIRQ_LSB    _u(15)
#define RVCSR_MEICONTEXT_NOIRQ_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RVCSR_MEICONTEXT_IRQ
// Description : Current IRQ number (read/write). Set to `meinext.irq` when
//               `meinext.update` is written. No hardware effect.
#define RVCSR_MEICONTEXT_IRQ_RESET  _u(0x000)
#define RVCSR_MEICONTEXT_IRQ_BITS   _u(0x00001ff0)
#define RVCSR_MEICONTEXT_IRQ_MSB    _u(12)
#define RVCSR_MEICONTEXT_IRQ_LSB    _u(4)
#define RVCSR_MEICONTEXT_IRQ_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RVCSR_MEICONTEXT_MTIESAVE
// Description : Reads as the current value of `mie.mtie`, if `clearts` is set
//               by the same CSR access instruction. Otherwise reads as 0.
//               Writes are ORed into `mie.mtie`.
#define RVCSR_MEICONTEXT_MTIESAVE_RESET  _u(0x0)
#define RVCSR_MEICONTEXT_MTIESAVE_BITS   _u(0x00000008)
#define RVCSR_MEICONTEXT_MTIESAVE_MSB    _u(3)
#define RVCSR_MEICONTEXT_MTIESAVE_LSB    _u(3)
#define RVCSR_MEICONTEXT_MTIESAVE_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RVCSR_MEICONTEXT_MSIESAVE
// Description : Reads as the current value of `mie.msie`, if `clearts` is set
//               by the same CSR access instruction. Otherwise reads as 0.
//               Writes are ORed into `mie.msie`.
#define RVCSR_MEICONTEXT_MSIESAVE_RESET  _u(0x0)
#define RVCSR_MEICONTEXT_MSIESAVE_BITS   _u(0x00000004)
#define RVCSR_MEICONTEXT_MSIESAVE_MSB    _u(2)
#define RVCSR_MEICONTEXT_MSIESAVE_LSB    _u(2)
#define RVCSR_MEICONTEXT_MSIESAVE_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RVCSR_MEICONTEXT_CLEARTS
// Description : Write-1 self-clearing field. Writing 1 will clear `mie.mtie`
//               and `mie.msie`, and present their prior values in the
//               `mtiesave` and `msiesave` of this register. This makes it safe
//               to re-enable IRQs (via `mstatus.mie`) without the possibility
//               of being preempted by the standard timer and soft interrupt
//               handlers, which may not be aware of Hazard3's interrupt
//               hardware.
//
//               The clear due to `clearts` takes precedence over the set due to
//               `mtiesave`/`msiesave`, although it would be unusual for
//               software to write both on the same cycle.
#define RVCSR_MEICONTEXT_CLEARTS_RESET  _u(0x0)
#define RVCSR_MEICONTEXT_CLEARTS_BITS   _u(0x00000002)
#define RVCSR_MEICONTEXT_CLEARTS_MSB    _u(1)
#define RVCSR_MEICONTEXT_CLEARTS_LSB    _u(1)
#define RVCSR_MEICONTEXT_CLEARTS_ACCESS "SC"
// -----------------------------------------------------------------------------
// Field       : RVCSR_MEICONTEXT_MRETEIRQ
// Description : If 1, enable restore of the preemption priority stack on
//               `mret`. This bit is set on entering the external interrupt
//               vector, cleared by `mret`, and cleared upon taking any trap
//               other than an external interrupt.
//
//               Provided `meicontext` is saved on entry to the external
//               interrupt vector (before enabling preemption), is restored
//               before exiting, and the standard software/timer IRQs are
//               prevented from preempting (e.g. by using `clearts`), this flag
//               allows the hardware to safely manage the preemption priority
//               stack even when an external interrupt handler may take
//               exceptions.
#define RVCSR_MEICONTEXT_MRETEIRQ_RESET  _u(0x0)
#define RVCSR_MEICONTEXT_MRETEIRQ_BITS   _u(0x00000001)
#define RVCSR_MEICONTEXT_MRETEIRQ_MSB    _u(0)
#define RVCSR_MEICONTEXT_MRETEIRQ_LSB    _u(0)
#define RVCSR_MEICONTEXT_MRETEIRQ_ACCESS "RW"
// =============================================================================
// Register    : RVCSR_MSLEEP
// Description : M-mode sleep control register
#define RVCSR_MSLEEP_OFFSET _u(0x00000bf0)
#define RVCSR_MSLEEP_BITS   _u(0x00000007)
#define RVCSR_MSLEEP_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : RVCSR_MSLEEP_SLEEPONBLOCK
// Description : Enter the deep sleep state configured by
//               msleep.deepsleep/msleep.powerdown on a `h3.block` instruction,
//               as well as a standard `wfi`. If this bit is clear, a `h3.block`
//               is always implemented as a simple pipeline stall.
#define RVCSR_MSLEEP_SLEEPONBLOCK_RESET  _u(0x0)
#define RVCSR_MSLEEP_SLEEPONBLOCK_BITS   _u(0x00000004)
#define RVCSR_MSLEEP_SLEEPONBLOCK_MSB    _u(2)
#define RVCSR_MSLEEP_SLEEPONBLOCK_LSB    _u(2)
#define RVCSR_MSLEEP_SLEEPONBLOCK_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RVCSR_MSLEEP_POWERDOWN
// Description : Release the external power request when going to sleep. The
//               function of this is platform-defined -- it may do nothing, it
//               may do something simple like clock-gating the fabric, or it may
//               be tied to some complex system-level power controller.
//
//               When waking, the processor reasserts its external power-up
//               request, and will not fetch any instructions until the request
//               is acknowledged. This may add considerable latency to the
//               wakeup.
#define RVCSR_MSLEEP_POWERDOWN_RESET  _u(0x0)
#define RVCSR_MSLEEP_POWERDOWN_BITS   _u(0x00000002)
#define RVCSR_MSLEEP_POWERDOWN_MSB    _u(1)
#define RVCSR_MSLEEP_POWERDOWN_LSB    _u(1)
#define RVCSR_MSLEEP_POWERDOWN_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RVCSR_MSLEEP_DEEPSLEEP
// Description : Deassert the processor clock enable when entering the sleep
//               state. If a clock gate is instantiated, this allows most of the
//               processor (everything except the power state machine and the
//               interrupt and halt input registers) to be clock gated whilst
//               asleep, which may reduce the sleep current. This adds one cycle
//               to the wakeup latency.
#define RVCSR_MSLEEP_DEEPSLEEP_RESET  _u(0x0)
#define RVCSR_MSLEEP_DEEPSLEEP_BITS   _u(0x00000001)
#define RVCSR_MSLEEP_DEEPSLEEP_MSB    _u(0)
#define RVCSR_MSLEEP_DEEPSLEEP_LSB    _u(0)
#define RVCSR_MSLEEP_DEEPSLEEP_ACCESS "RW"
// =============================================================================
// Register    : RVCSR_DMDATA0
// Description : The Debug Module's DATA0 register is mapped into Hazard3's CSR
//               space so that the Debug Module can exchange data with the core
//               by executing CSR access instructions (this is used to implement
//               the Abstract Access Register command). Only accessible in Debug
//               Mode.
#define RVCSR_DMDATA0_OFFSET _u(0x00000bff)
#define RVCSR_DMDATA0_BITS   _u(0xffffffff)
#define RVCSR_DMDATA0_RESET  _u(0x00000000)
#define RVCSR_DMDATA0_MSB    _u(31)
#define RVCSR_DMDATA0_LSB    _u(0)
#define RVCSR_DMDATA0_ACCESS "RW"
// =============================================================================
// Register    : RVCSR_CYCLE
// Description : Read-only U-mode alias of mcycle, accessible when
//               `mcounteren.cy` is set
#define RVCSR_CYCLE_OFFSET _u(0x00000c00)
#define RVCSR_CYCLE_BITS   _u(0xffffffff)
#define RVCSR_CYCLE_RESET  _u(0x00000000)
#define RVCSR_CYCLE_MSB    _u(31)
#define RVCSR_CYCLE_LSB    _u(0)
#define RVCSR_CYCLE_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_INSTRET
// Description : Read-only U-mode alias of minstret, accessible when
//               `mcounteren.ir` is set
#define RVCSR_INSTRET_OFFSET _u(0x00000c02)
#define RVCSR_INSTRET_BITS   _u(0xffffffff)
#define RVCSR_INSTRET_RESET  _u(0x00000000)
#define RVCSR_INSTRET_MSB    _u(31)
#define RVCSR_INSTRET_LSB    _u(0)
#define RVCSR_INSTRET_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_CYCLEH
// Description : Read-only U-mode alias of mcycleh, accessible when
//               `mcounteren.cy` is set
#define RVCSR_CYCLEH_OFFSET _u(0x00000c80)
#define RVCSR_CYCLEH_BITS   _u(0xffffffff)
#define RVCSR_CYCLEH_RESET  _u(0x00000000)
#define RVCSR_CYCLEH_MSB    _u(31)
#define RVCSR_CYCLEH_LSB    _u(0)
#define RVCSR_CYCLEH_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_INSTRETH
// Description : Read-only U-mode alias of minstreth, accessible when
//               `mcounteren.ir` is set
#define RVCSR_INSTRETH_OFFSET _u(0x00000c82)
#define RVCSR_INSTRETH_BITS   _u(0xffffffff)
#define RVCSR_INSTRETH_RESET  _u(0x00000000)
#define RVCSR_INSTRETH_MSB    _u(31)
#define RVCSR_INSTRETH_LSB    _u(0)
#define RVCSR_INSTRETH_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MVENDORID
// Description : Vendor ID
#define RVCSR_MVENDORID_OFFSET _u(0x00000f11)
#define RVCSR_MVENDORID_BITS   _u(0xffffffff)
#define RVCSR_MVENDORID_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : RVCSR_MVENDORID_BANK
// Description : Value of 9 indicates 9 continuation codes, which is JEP106 bank
//               10.
#define RVCSR_MVENDORID_BANK_RESET  _u(0x0000009)
#define RVCSR_MVENDORID_BANK_BITS   _u(0xffffff80)
#define RVCSR_MVENDORID_BANK_MSB    _u(31)
#define RVCSR_MVENDORID_BANK_LSB    _u(7)
#define RVCSR_MVENDORID_BANK_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RVCSR_MVENDORID_OFFSET
// Description : ID 0x13 in bank 10 is the JEP106 ID for Raspberry Pi Ltd, the
//               vendor of RP2350.
#define RVCSR_MVENDORID_OFFSET_RESET  _u(0x13)
#define RVCSR_MVENDORID_OFFSET_BITS   _u(0x0000007f)
#define RVCSR_MVENDORID_OFFSET_MSB    _u(6)
#define RVCSR_MVENDORID_OFFSET_LSB    _u(0)
#define RVCSR_MVENDORID_OFFSET_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MARCHID
// Description : Architecture ID (Hazard3)
#define RVCSR_MARCHID_OFFSET _u(0x00000f12)
#define RVCSR_MARCHID_BITS   _u(0xffffffff)
#define RVCSR_MARCHID_RESET  _u(0x0000001b)
#define RVCSR_MARCHID_MSB    _u(31)
#define RVCSR_MARCHID_LSB    _u(0)
#define RVCSR_MARCHID_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MIMPID
// Description : Implementation ID. On RP2350 this reads as 0x86fc4e3f, which is
//               release v1.0-rc1 of Hazard3.
#define RVCSR_MIMPID_OFFSET _u(0x00000f13)
#define RVCSR_MIMPID_BITS   _u(0xffffffff)
#define RVCSR_MIMPID_RESET  _u(0x86fc4e3f)
#define RVCSR_MIMPID_MSB    _u(31)
#define RVCSR_MIMPID_LSB    _u(0)
#define RVCSR_MIMPID_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MHARTID
// Description : Hardware thread ID
//               On RP2350, core 0 has a hart ID of 0, and core 1 has a hart ID
//               of 1.
#define RVCSR_MHARTID_OFFSET _u(0x00000f14)
#define RVCSR_MHARTID_BITS   _u(0xffffffff)
#define RVCSR_MHARTID_RESET  "-"
#define RVCSR_MHARTID_MSB    _u(31)
#define RVCSR_MHARTID_LSB    _u(0)
#define RVCSR_MHARTID_ACCESS "RO"
// =============================================================================
// Register    : RVCSR_MCONFIGPTR
// Description : Pointer to configuration data structure (hardwired to 0)
#define RVCSR_MCONFIGPTR_OFFSET _u(0x00000f15)
#define RVCSR_MCONFIGPTR_BITS   _u(0xffffffff)
#define RVCSR_MCONFIGPTR_RESET  _u(0x00000000)
#define RVCSR_MCONFIGPTR_MSB    _u(31)
#define RVCSR_MCONFIGPTR_LSB    _u(0)
#define RVCSR_MCONFIGPTR_ACCESS "RO"
// =============================================================================
#endif // _HARDWARE_REGS_RVCSR_H

